[{"t":"Airflow Solutions","s":"airflow-solutions","a":"ekrof","c":"<p>Proper air circulation is essential for Space Buckets (and every other kind of indoor garden). <strong>Your bucket needs good ventilation to extract the heat</strong> from the <a href=\"https://amzn.to/3jMfTYw\">CFL bulbs</a> (or LED lights), and also to give the plant breaths of fresh air and plenty of CO2. In this section we review good ventilation solutions that you can use for cooling your always trusty bucket garden.</p>\n<pre> <img src='https://spacebuckets.com/u/ranger737/403731.jpg'/> <div>Inline fans can be used with filters to control smells</div> </pre>\n<h3>110/220v fans</h3>\n<p>These fans are a step up from standard PC fans, as they run at line voltage (110v or 220v, depending on where you live). <em>This cooling solution is sturdy and reliable</em>, protected with a metal frame. Most of these fans also come wired with a plug for easy installation in the garden. A typical 110v fan works at about 50CFM, with a noise level of 40dBA. <strong>These units have 40% more airflow than PC fans</strong>, which makes them a good choice for cooling small spaces (and also for DIY carbon filters such as this one).</p>\n<h3>12v PC fans</h3>\n<p>This is a basic and cheap solution for ventilation and cooling in Space Buckets. <em>PC fans are easy to find and recycle, and they provide enough airflow</em> to extract the heat from your garden. Keep in mind that in order to run PC fans you need a 12v power supply, which are also cheap and readily available. With 1A you can run 2 fans safely, though your mileage may vary and testing is always recommended. A typical 12v PC fan works at about 30 CFM (Cubic Feet per Minute) with a noise level of 26 dBA. These are usually not b enough to handle carbon filters.</p>\n<h3>Inline/Booster fans</h3>\n<p>Duct fans are a great (and often overlooked) alternative for cooling Space Buckets, as they provide good airflow: the 4' version provides about 100 CFM, which is 70% more than standard PC fans. <strong>These inline fans can be used in high temperature situations</strong> to extract the heat from the bulbs. These fans also work at line voltage (110v or 220v), and they come already wired with a plug, so installation is a matter of fitting it in the bucket and turning it on. Booste fans are cheaper kind of inline fan, which can be also used for odor carbon filtering.</p>\n","o":"3","d":"Proper air circulation is essential for Space Buckets (and every other kind of indoor garden). Your bucket needs good ventilation to extract the heat from the CFL bulbs (or LED lights), and also to give the plant breaths of fresh air and plenty of CO2.","i":[]},{"t":"Begin your Journey","s":"begin-your-journey","a":"ekrof","c":"<pre> <img src='https://spacebuckets.com/template/3e3d32.jpg'/> <div>A group of Space Buckets in their natural habitat</div> </pre>\n<p><em>A Space Bucket is a DIY indoor garden</em> that is made by stacking plastic containers alongside <a href=\"/docs/lighting-solutions\">lighting (CFL or LED)</a> and <a href=\"/docs/airflow-solutions\">airflow (PC or other fans)</a>. It is an enclosed growth chamber that can be used to garden many kinds of plants.</p>\n<p><b>A Space Bucket is a versatile gardening tool</b> that can be adapted to the users needs. Every variable of its environment can be <b>tweaked and upgraded</b>: for example, some plants may require more light intensity than others, or different humidity conditions.</p>\n<p>Space Buckets is also <em>a movement of gardeners, a community of botanically inclined individuals</em> who like to grow plants indoors and share information freely. The <a href='https://www.reddit.com/r/SpaceBuckets'>/r/SpaceBuckets subreddit</a> is our main forum, and this website is its companion. Bucketeers are open, friendly and thorough, as the <a href=\"/docs/manifesto\">manifesto states</a>.</p>\n<ul>\n<li><a href=\"/docs/main-container\">Start by choosing a main container »</a></li>\n<li><a href=\"/docs/safety-guidelines\">Always follow SAG's safety guidelines »</a></li>\n<li><a href=\"/gallery\">View over 350 build examples in the Gallery »</a></li>\n</ul>\n<h3>What type of lighting should I use?</h3>\n<pre> <img src='https://spacebuckets.com/template/19140e.jpg'/> <div>CFL bulbs are a low cost alternative to LED</div> </pre>            \n<p><em>You can choose CFL or LED for your bucket.</em> The LED option can be solved with a <a href=\"https://amzn.to/3nnX3eV\">UFO LED grow light</a>. The recommended size is the '180w' model for a typical 5gal Space Bucket. If you go the CFL route, about <a href=\"https://amzn.to/393Ihl2\">4x23w bulbs will be needed</a>. You can <a href=\"/docs/light-colors\">mix light spectrums</a> (like 2700K and 6500K) during the whole life of the plant, though warm-white is preferred for all around plant growth. <b>Either configuration can be used along <a href=\"https://amzn.to/3hj99Cn\">5630SMD LED light strips</a></b>. These lights stick to the walls of the bucket for extra photosynthesis.</p>\n<ul>\n<li><a href=\"/docs/lighting-solutions\">Learn more about lighting solutions »</a></li>\n<li><a href=\"/docs/led-sidelighting\">Learn more about LED sidelighting »</a></li>\n</ul>\n<h3>Will my electrical bill increase?</h3>\n<p>Great answer by <a href='https://www.reddit.com/u/bent42'>/u/bent42</a>: <i>'There are two factors: <b>the wattage of your lights, and your cost per Kilowatt.</b> Electricity is billed by the Kilowatt/hour. So if you know the <a href=\"/docs/equivalent-wattage\">'true' watts of your lights</a> (and fans) and how long they are on, you can easily calculate the cost. For example: 150 watts total x 24 hours of veg = 3600 watts in 24 hours, or 3.6 kilowatts a day. The average price per kilowatt/hour in the US is around 12 cents, so 3.6*$0.12=$0.43/day in veg, or about $13/mo, and about half that in flower.'</i></p>\n<ul>\n<li><a href=\"/docs/electrical-basics\">Learn more about electrical basics »</a></li>\n</ul>\n<h3>What plants can I grow with this setup?</h3>    \n<pre> <img src='https://spacebuckets.com/u/cherry-tomato-journal/1e190b.jpg'/> <div>Cherry tomatoes love to grow in Space Buckets</div> </pre>      \n<p><em>You can grow any plant you can imagine!</em> Space Buckets can be used for the entire life of most plants, and also works great for germinating seeds or maintaining clones. You will see that Cannabis is a very popular choice among bucketeers, but its not the only thing that thrives in this DIY indoor garden. Users from the <a href=\"https://www.reddit.com/r/SpaceBuckets\">subreddit community</a> have grown <b>Tomatoes, Peppers, Dill, Chives, Basil, and even Wasabi and Avocado!</b> All plants enjoy the bucket garden, especially herbs and fruits. You are invited to try new types of plants, every species deserves a bucket. Plant experimentation is encouraged! Why not some SB avocados, succulents or potatoes?</p>\n<ul>\n<li><a href=\"/docs/plant-species\">Learn more about bucket plant species »</a></li>\n<li><a href=\"/docs/pest-control\">Learn more about controlling plant pests »</a></li>\n</ul>\n<h3>Which training techniques work best?</h3>\n<pre> <img src='https://spacebuckets.com/u/levitatingchicken/aba09f.jpg'/> <div>An inline filtered Space Bucket with 5gal buckets</div> </pre>\n<p><b>LST (low-stress training)</b> is a basic tool for keeping the height of the plant under control. You can use hooks to tie the branches to the soil or the side of the pot. You can even create a <b>SCROG net</b> to grow as horizontally as possible. <b>Topping</b> is another recommended training technique for a bucket grow: you have to cut the top-most growth of the plant. This will cause it to bush out, and two tops will appear from the 'shoulders' of the node. <b>Pruning</b> can be a good idea too: you can remove some leaves if they're blocking too much light from the tops. This is better done in moderation.</p>\n<ul>\n<li><a href=\"/docs/plant-training\">Learn more about plant training for small spaces »</a></li>\n</ul>\n<h3>What to do about smelly plants?</h3>\n<p>To control odors from your plants, you will need <em>powerful ventilation and some type of carbon filter</em>. If you want to get rid of mostly all the smell, you should look into <a href=\"https://amzn.to/3z4Cdnh\">inline fans and filters</a>, which can be connected with ducting to one or more buckets. Another option is <b><a href=\"https://amzn.to/3nsOJKW\">ONA gel</a></b>, as SAG says: 'ONA does wonders particularly during a harvest where a simple charcoal filter may not cut it'. You have to put the gel outside of the bucket, near the exhaust fan.</p>\n<ul>\n<li><a href=\"/docs/airflow-solutions\">Learn more about airflow solutions »</a></li>\n<li><a href=\"/docs/smell-control\">Learn more about smell control »</a></li>\n</ul>\n","o":"3","d":"A Space Bucket is a DIY indoor garden that is made by stacking plastic containers alongside lighting (CFL or LED) and airflow (PC or other fans). It is an enclosed growth chamber that can be used to garden many kinds of plants. A Space Bucket is a versatile gardening tool that can be adapted to the users needs.","i":[]},{"t":"Coco Coir","s":"coco-coir","c":"<p>Coco coir is essentially made from coconut husks. It's a fibrous material that has excellent drainage, <strong>a soilless medium that has grown in popularity in the last years</strong>. In this guide I will walk you through my coco plant growing process.</p>\n<h3>General Usage</h3>\n<p>I use 5 parts coco coir and 1 part off-the-shelf perlite. I mix these thoroughly, until the mixture is as homogenous as possible. I next fill my pot(s) with the coco mix. Before thinking of planting, <strong>I flush the coco thoroughly with water at a pH of around 6.0</strong>. Coco works similarly to hydroponics. The coco itself has no nutrients, so it relies solely on what you put in. This a huge pro and also a con. It gives you ultimate control of nutrient intake. pH should be kept between 5.5 and 6.5, although I never stray outside of 5.8 to 6.2. <strong>Invest in a good pH meter.</strong>   Important tip: use Calmag! Coco coir tends to absorb and prevent the distribution of calcium. The solution is to add CalMag when adding nutrients, per the instructions (it's about 1ml / liter of water). It's pretty much impossible to over-water coco coir. If you add too much water it simply drains out of the bottom. You should aim to water the plant until you first see run-off, then add about 20% more water / water-nutrient mix. It should be flushed regularly as salts (aka the some of the nutrients you put in) will accumulate on the coco fibers. Water when the pot gets light in weight. I've learned to pick up the pot and feel when it needs to be watered. You might not be able to over water coco coir, but you can certainly water it too often. This can result in fungus gnats (minor nuissance), or other issues. I generally wait until the pot has lost 3/4 of its weight before watering. A full grown plant needs to be watered every 2 days. A smaller plant in a big pot may only need water every 7 days. Depending on you schedule, you'll likely be watering as follows: (Water with Nutrients, pure water, pure water, repeat). If you have deficiencies you can alter this schedule: nutes-water-nutes-water, or nutes-nutes-water.</p>\n<h3>Measuring PPM</h3>\n<p>I also invested in an TDS gauge. <strong>This measures the level of dissolved salts: nutrients and naturally occurring minerals in the water.</strong> The measurement is in ppm (Parts per Million). This gauge can help prevent nutrient burn by ensuring that the water you put in doesn't have too much nutrients. It's easy to use, and there are several guides online on what your ppm should be during various stages of growth (seedling, vegetative, flowering). I use the gauge to measure the water going in and the runoff out the bottom of the pot. If the ppm is too high I simply dilute the water+nutrient solution, recheck the ppm and pH, adjusting if needed.</p>\n<h3>pH Control and Nutrients</h3>\n<p><strong>I've been using Advanced Nutrients pH perfect and it's worked well.</strong> pH perfect is a bit of a misnomer: you still need to adjust the pH a bit for optimal results. Although I bought pH Down (Phosphoric Acid 85%) and pH Up, I've only ever used the pH Down. My tap water is at a steady 7.0 (lucky me). So, a few drops of pH Down are all that are needed to get the pH in the proper range. If I overshoot, I simply dilute my container with tap water so the pH goes back up and add a bit more nutrients. A few companies sell coco-specific nutrients. This goes without saying, but with nutes less is more. The only deficiency I've had was Calcium. Other than that, I've had nutrient burn more than once. <strong>I've adopted a new strategy of using as little nutes as possible</strong>, almost waiting for the plant to tell me it has a deficiency before adding nutrients. Unlike soil, you can change the nutrient conditions very quickly with coco coir. Since it's so porous and drains well, you can quickly add nutes or pure water to adjust any issues with the plant. With soil, you have to contend with whats in the soil already, which can often work against you. The downside is that you have to watch the plants like a hawk, since nutrient deficiencies or nutrient burn can happen very quickly.</p>\n","o":"14","d":"Coco coir is essentially made from coconut husks. It's a fibrous material that has excellent drainage, a soilless medium that has grown in popularity in the last years. In this guide I will walk you through my coco plant growing process.","i":[]},{"t":"CRI (Color Rendering Index)","s":"color-rendering-index","a":"SuperAngryGuy","c":"<p><em>CRI (Color Rendering Index) tells us how well a light source does at accurately reproducing colors</em> in an object relative to a natural or black body radiation source (like the sun, incandescent bulb). It really falls flat, though, and a different standard has come out called TM-30. It doesn't actually replace CRI because they are standards from two different organizations, the <a href=\"https://cie.co.at/\">CIE (International Commission on Illumination)</a> for CRI, and <a href=\"https://www.ies.org/\">ANSI/IES (American National Standards Institute/Illuminating Engineering Society)</a> for TM-30.</p>\n<pre> <img src='https://i.imgur.com/xHuRtoY.jpg'/> <div>The CIE 1960 UCS Color Space</div> </pre>\n<p><strong>CRI plays a larger role in lux to PPFD (umol/m2/sec) conversions than color temperature.</strong> Higher CRI lighting will have a greater amount of deeper reds, which naturally have a lower luminous flux at the same radiant flux (because it takes into account the sensitivity of our eyes by wavelength). In other words, the deeper reds have a lower luminous efficiency. You can see the differences in my <a href=\"/docs/lux-ppfd-conversion\">spectroradiometer SPD charts</a>.\nA white LED that is 100% efficient that draws one watt of power (one joule per second) <strong>will output about 320 lumens of light at CRI 80</strong>. An LED with a CRI of 80 that outputs 200 lumens per watt will have an efficiency of 200/320= 63%. But an LED with a CRI of 100 that output 200 lumens per watt will have an efficiency of 200/280 = 71%.</p>\n<h3>TM-30 Measurements</h3>\n<p><em>Fidelity Index (Rf)</em> is used with TM-30 measurements and is sort of like CRI (0-100 scale with higher being better, but CRI can also have a negative number), but there's 99 color evaluation samples with a wide range of hue (base color), chroma (amount of saturation), and lightness. <strong>It is the average amount of 'color smearing'</strong> in the 99 color samples, or the average of how far off one is from the color samples. An ultra high CRI bulb can have a TM-30-15 Rf of 94, and around 60 should be the minimum for indoor lighting (higher for living areas). The US Dept of Energy <a href=\"https://www.energy.gov/eere/ssl/tm-30-frequently-asked-questions\">has a great tutorial on TM-30</a>.\n<em>Gamut Index (Gf)</em> with TM-30 ranges from 80-120 and is basically the amount of saturation with 100 being a neutral saturation. <strong>It is the color gamut area.</strong> Lower Gf white lights will make objects appear duller with higher Gf having colors more saturated.</p>\n","d":"The CRI (Color Rendering Index) measurement tells us how well a light source does at accurately reproducing colors in an object relative to a natural or black body radiation source (like the sun, or an incandescent bulb). It really falls flat, though, and a different standard has come out called TM-30.","f":"<b>CRI (Color Rendering Index)</b> tells us how well a light source does at accurately reproducing colors in an object relative to a radiation source.","i":[]},{"t":"Core Lighting Concepts","s":"core-lighting-concepts","a":"SuperAngryGuy","c":"<p>The topics below represent the core concepts in Horticulture Lighting Theory. This article features basic definitions to get you started on this science.</p>\n<h3>PAR (Photosynthetic Active Radiation)</h3>\n<p><em>PAR is light from the 400-700nm wavelengths by standard definition</em> (far red light that has a wavelength longer than 700nm is not be included). It is important to understand PAR is what we measure and not a unit of measurement: for example, '300 PAR' makes no sense because the person could be talking about PAR watts. As a reference, around 4.6 µmol/m2/sec is one PAR watt/m2 for white light (CRI 80).</p>\n<ul>\n<li><a href=\"/docs/lux-meters\">Learn how to use Lux Meters and Sensors »</a></li>\n</ul>\n<h3>PPFD (Photosynthetic Photon Flux Density)</h3>\n<pre> <img src='https://i.imgur.com/tbSX33P.jpg'/> <div>Photosynthetic Light Response Curves (<a href='https://fluence.science/science-articles/horticulture-lighting-metrics/'>source</a>)</div> </pre>\n<p><em>This is the intensity or the amount of the light</em> at the point that the measurement was made. <strong>Lux is a close white light equivalent.</strong> PPFD is measured in units of µmol/m2/sec or 'micromoles per square meter per second' also written as µmol m-2 s-1. This unit of light alone tells nothing about the wavelength(s) of light, only the amount of PAR when measuring PAR in this unit.\nWe measure PPFD with a type of light meter called a <a href=\"https://amzn.to/3yiwoSy\">quantum light meter</a>. Quantum in this case is not some gimmick marketing term but rather to emphasize that the meter is measuring the actual number of photons, the quanta or individual particle of the electromagnetic field, being radiated to a space (such as the top of a plant canopy).</p>\n<ul>\n<li><a href=\"/docs/lux-ppfd-conversion\">Learn more about Lux to PPFD conversions »</a></li>\n<li><a href=\"/docs/lux-lighting-levels\">Learn more about optimal Lux Lighting Levels »</a></li>\n</ul>\n<h3>PPF (Photosynthetic Photon Flux)</h3>\n<p><em>This is the total light given off by a light source.</em> PPF is measured in µmol/sec or 'micromoles per second' also written as µmol s-1. <strong>Lumens is a close white light equivalent</strong>. PPE times the wattage of the light equals PPF.\nThere is some confusion about this term. It can be argued that this is the same as PPFD but it is being defined by <a href=\"https://asabe.org\">ASABE</a> and will most certainly be accepted as an industry standard to define how much light is being given radiated by a lighting source. It can be a bit naive to use PPF to try to calculate PPFD numbers: if you do then be sure that you over estimate.</p>\n<ul>\n<li><a href=\"/docs/luminous-efficiency\">Learn more about Luminous Efficiency »</a></li>\n<li><a href=\"/docs/luminous-efficiency\">Dive into Equivalent Wattage for lights »</a></li>\n</ul>\n<h3>PPE (Photosynthetic Photon Efficacy)</h3>\n<pre> <img src='https://i.imgur.com/Jnwqhfa.jpg'/> <div>A high efficacy LED example (<a href='https://www.nature.com/articles/s41438-020-0283-7'>source</a>)</div> </pre>\n<p><em>This is how many photons of light are generated</em> per joule (watt * second) of energy input. PPF/Watts will give the PPE. <strong>Lumens per watt is a close white light equivalent.</strong> PPE is measured in µmol/joule or 'micromoles per joule' also written as µmol/J.\nThis is a critical measurement of lighting sources that tells us how much light is being radiated per amount of energy consumed by the light source. It is literally a metric of how many photons are being produced per joule of energy input. Top end grow lights put out about 2.4 umol/joule, while low end lights are about 0.9-1.3 uMol/joule. With cheaper lights you may save money initially but you will get hit with much higher energy usage costs long term. As a general rule, don't buy a grow light for professional use unless you know the uMol/joule number.</p>\n<ul>\n<li><a href=\"/docs/luminous-efficacy\">Learn more about Luminous Efficacy »</a></li>\n<li><a href=\"/docs/efficacy-limits\">Dive into Efficacy Limits »</a></li>\n</ul>\n<h3>DLI (Daily Light Integral)</h3>\n<p><strong>This is the amount of light a plant receives per day measured in mol/m2/d</strong> or 'moles per square meter per day'. An easy way to quickly calculate the DLI is to take 100 umol/m2/sec * 24 hours = DLI of 8.5. We can say that 24 hour lighting at 200 umol/m2/sec is a DLI of 17 mol/m2/day. If I have 400 umol/m2/sec of light for 16 hours per day then the DLI is 4 * 8.5 constant * (16/24) of a day = round up to DLI of 23 mol/m2/day. The constant is actually 8.6 for 100 umol/m2/sec at 24 hour lighting but 8.5 is easier to calculate.</p>\n<ul>\n<li><a href=\"/docs/daily-lighting-integral\">Learn more about the Daily Lighting Integral »</a></li>\n</ul>\n<h3>CRI (Color Rendering Index)</h3>\n<p><em>CRI is how well the reflected light of different colors look.</em> CRI 90 and above light will have deeper reds that will read lower with a lux meter, although the true PPFD levels may be the same. The deeper reds is why CRI 80 and 90 have different lux to PPFD conversion values. Roughly speaking, a CRI 100 light has a luminous efficacy of around 250-260 LPW (lumens per watt) at 100% efficiency, CRI 95 is 280 LPW, CRI 90 is 300 LPW, and CRI 80 is 320 LPW. In the real world, these numbers can vary by 10% or so.\nThe higher the CRI number, the greater and deeper the red light we will have. Our eyes have less red light sensitivity compared to other colors, so a really high CRI light will have less lumens per watt although there may be the same amount of light being produced as umol/sec and as perceived by the plant.</p>\n<ul>\n<li><a href=\"/docs/color-rendering-index\">Learn more about the Color Rendering Index »</a></li>\n<li><a href=\"/docs/light-colors\">Read about how light colors affect plants »</a></li>\n</ul>\n<pre> <img src='https://i.imgur.com/zTmt4oa.jpg'/> <div>Chromaticity diagram for CCT (<a href='https://www.nextgenerationled.be/EN/CorrelatedColorTemperature.html'>source</a>)</div> </pre>\n<h3>CCT (Correlated Color Temperature)</h3>\n<p><em>CCT is basically the red-blue ratio of a white light source</em> and correlates to (i.e. appears to us as) the color temperature of a black body radiation source in degrees kelvin. Higher CCT, having more blue light, will keep plants more compact at a given lighting level. 3000K and 3500K are pretty common for all around use. Roughly speaking, 2700K is 10% blue, 4200K is 20% blue, and 6500K is 30% blue.\nFor an artificial lighting source such as LED lighting, CCT is how white light is perceived. Cool white will have a higher blue light ratio and be at a higher CCT such as 6500K. Warm white will have a higher red light ratio and have a lower CCT such as 2700K. Higher color temperatures are common for vegetative growth since the higher blue light ration will help keep plants more compact.</p>\n<ul>\n<li><a href=\"/docs/mixing-colors\">Dive into color mixing theory »</a></li>\n<li><a href=\"/docs/ultraviolet-growing\">Ultraviolet light growing considerations »</a></li>\n</ul>\n<h3>McCree Curve</h3>\n<p>This is a chart averaged of 22 different types of plants used in botany that <strong>shows the amount of photosynthesis that occurs by wavelength</strong>. The McCree curve is only valid at 50 uMol/m2/sec of monochromatic light with the single leaf model but a useful starting point. The McCree curve is different than absorption curves of pigments isolated from a plant leaf and gives much more realistic information as to how plants respond to photosynthesis by wavelength.</p>\n<ul>\n<li><a href=\"/docs/mccree-curve\">Learn more about the McCree Curve »</a></li>\n<li><a href=\"/docs/emerson-effect\">Learn more about the Emerson Effect »</a></li>\n</ul>\n","d":"The topics below represent the core concepts in Horticulture Lighting Theory: learn about PAR, PPFD, PPE, CCT, McCree Curve and the Emerson far red Effect. This article features basic definitions to get you started on this amazing science.","i":[]},{"t":"DLI (Daily Lighting Integral)","s":"daily-lighting-integral","a":"SuperAngryGuy","c":"<p><em>DLI is the amount of light that the plant receives in a 24 hour period.</em> The unit of measurement is mol/m2/day or 'moles per square meter per day'. This usually only counts the top light, and intracanopy or side lighting can greatly increase these numbers. DLI does not take in to account that as the intensity of the light increases in PPFD that the photosynthetic efficiency of the plant decreases.</p>\n<pre> <img src='https://i.imgur.com/FbiClOM.jpg'/> <div>Daily Lighting Integral representation <a href='https://dutchlightinginnovations.com/blog/daily-light-integral/'>(source)</a></div> </pre>\n<blockquote>\n<p>The DLI concept is like a rain gauge. Just as a rain gauge collects the total rain in a particular location over a period of time, so <strong>DLI measures the total amount of PAR received in a day</strong>. Growers can use light meters to measure the number of light photons that accumulate in a square meter over a 24-hour period. DLI is an important variable to measure because <em>it influences plant growth, development, yield, and quality</em>. For example, DLI can influence the root and shoot growth of seedlings and cuttings, plant quality (such as branching, flower number and stem thickness), and timing. Torres, Ariana and Lopez, Roberto. <a href=\"https://www.extension.purdue.edu/extmedia/HO/HO-238-W.pdf\">Measuring Daily Light Integral in a Greenhouse.</a> Purdue University</p>\n</blockquote>\n<h3>How to calculate DLI</h3>\n<p>This formula will give the DLI for a 24 hour photoperiod: <strong>(PPFD/100) * 8.6</strong>. Following this logic you can multiply the result with the percentage of light on time per day: the formula will be <strong>((PPFD/100) * 8.6) * (% hours on per 24 hours)</strong>. As a reference, there is a Standford study that determined that lettuce does best at around a DLI of 17 or 17 moles of photons per square meter per day.</p>\n<ul>\n<li><strong>Example:</strong> 200 µmol/m2/sec on 18 hours per day. (200/100=2) (2 * 8.6=17.2) (17.2 * 0.75=12.9 mol/m2/day)</li>\n<li><strong>Example:</strong> 1200 µmol/m2/sec on 12 hours per day. (1200/100=12) (12 * 8.6=103.2) (103.2 * 0.50=51.6 mol/m2/day)</li>\n</ul>\n","d":"DLI is the amount of light that the plant receives in a 24 hour period._The unit of measurement is mol/m2/day or 'moles per square meter per day'. This usually only counts the top light, and intracanopy or side lighting can greatly increase these numbers.","f":"DLI is the <b>amount of light that the plant receives in a 24 hour period.</b> The unit of measurement is 'moles per square meter per day'.","i":[]},{"t":"LED Efficacy Limits","s":"efficacy-limits","a":"SuperAngryGuy","c":"<p>To maximize an LED grow light's idealized efficacy, <em>we want the LED current as low as possible</em> (throw more LEDs at the problem as they become cheaper and underdrive them), <em>keep them as cool as possible</em> (a little airflow goes a long ways, maybe 2-10 times so), <em>get the most efficient driver</em> (you want to look up the efficiency by current level curves in the data sheet), <strong>and don't use lenses or a glass cover</strong>. But, by not using a cover means we lose ingress protection leaving exposed voltages so there are potential safety concerns, and exposing the LEDs directly to the environment can potentially lower their longevity and the grow light's longer term reliability.</p>\n<pre> <img src='https://i.imgur.com/2LweZxA.jpg'/> <div> Historical, current, and projected LED efficacy</div> </pre>\n<blockquote>\n<p>The upper limit of LED fixture efficacy is determined by the LED package efficacy multiplied by four factors inherent to all fixtures: <strong>current droop, thermal droop, driver (power supply) inefficiencies, and optical losses</strong>. With current LED technology, the calculations indicate efficacy limits of 3.4 µmol J−1 for white + red fixtures, and 4.1 µmol J−1 for blue + red fixtures. Adding optical protection from water and high humidity reduces these values by ~10%. Paul Kusuma, P. Morgan Pattison &amp; Bruce Bugbee, <a href=\"https://www.nature.com/articles/s41438-020-0283-7\">From physics to fixtures to food: current and potential LED efficacy</a>.</p>\n</blockquote>\n<p>Keep in mind on LED grow light specs, some low end sellers may give specs (e.g PPF umol/sec numbers) for data sheet temperature and current ideal efficacy (i.e 25 C, lower nominal current), or may not take in to account LED driver losses when posting a umol/joule number, and not how the light actually performs in real world grow conditions. If low end style lights are giving specs better than high end lights, <strong>then don't don't do business with that seller</strong>.</p>\n<h3>Current droop</h3>\n<p><em>The greater the current though an LED, the less efficient it becomes</em>. This is one reasons why medium power LEDs in large series/parallel arrays (like the so-called quantum boards) have become common at least in the hobby community, and how COBs work by having a large series/parallel array of LEDs in a smaller common package. LED makers typical rate their LED at a <strong>'nominal' or 'sorting' current that may be significantly lower than what the LED is actually being driven at</strong> in real life. The <a href=\"https://www.samsung.com/led/lighting/mid-power-leds/3030-leds/lm301h/\">Samsung LM301H LED</a> has their specs listed for 65 mA, but is rated for 200 mA continuous, for example.</p>\n<h3>Thermal droop</h3>\n<p><em>The higher the temperature of the LED, the less efficient it becomes.</em> LED data sheets typically give bin numbers for 25°C (77°F) or 85°C (185°F), and most LEDs are specified to operate at 85-125°C. The difference between 25°C and 85°C is about <strong>a 5% efficiency loss for most LEDs</strong>. Some 125°C continuous rated red LEDs can take a &gt;20% efficiency hit at 125°C. Higher temperatures will also degrade LEDs faster (particularly red LEDs), and cheap light bulbs are going to run their cheap LEDs very hot. Don't buy the cheapest light bulbs if you want them to last: you get what you pay for.</p>\n<h3>Driver (power supply) inefficiencies</h3>\n<p>Some low voltage DC drivers can hit about <em>98% efficiency depending on drive current</em>. There are AC LED drivers on the market that can peak at 97% efficiency. Some Mean Well LED drivers can hit the mid 90% efficient. Most of the AC LED drivers you find in products are going to be in the low 90% or upper 80% percent efficient, which can depend on specific LED current levels. <strong>Drivers with a lower power factor also contribute to greater inefficiencies.</strong> Cheap capacitors in cheap lights (particularly cheap light bulbs) is a major failure mode particularly with poor thermal management.</p>\n<h3>Optical losses</h3>\n<p>Using secondary optics (i.e a lens) over an LED can focus the light so an LED grow light maker can post some impressive PPFD (intensity) numbers right below the light, but the PPF number (total light output) is going to drop as well. <em>There will always be optical losses with a lens of perhaps 7-9%.</em> This same loss applies to grow lights that have a glass/plastic/silicon cover over the LEDs for splash proofing the light. If you grow hydroponically, and a prone to splashing hydro nute solution around, it may be worth it to take this inefficiency hit to keep the salt solution away from the electronics. Electrical safety is another very important reason glass covers are used for the ingress protection they provide.</p>\n","d":"The upper limit of LED fixture efficacy is determined by the LED package efficacy multiplied by four factors inherent to all fixtures: current droop, thermal droop, driver (power supply) inefficiencies, and optical losses.","f":"The  limit of LED efficacy is determined by <b>four factors</b>: current droop, thermal droop, driver (power supply) inefficiencies, and optical losses","i":[]},{"t":"Electrical Basics","s":"electrical-basics","c":"<p>This article provides the basic electronics knowledge you'll need to build a Space Bucket. This is an extremely short introduction to electronics, so if you're interested in the topic you would do well to read something more comprehensive. The best book for beginning electronics is Practical Electronics for Inventors by Paul Scherz. It's cheap, covers a lot of material, and doesn't assume any prior knowledge.</p>\n<h3>AC, DC and Power</h3>\n<p><strong>AC stands for alternating current and DC stands for direct current.</strong> An AC voltage is just a sinusoidally-varying voltage. You can still use Ohm's law with AC voltages and currents. The power delivered to the outlet in your home is an AC voltage, <strong>usually around 115VAC or 230VAC</strong> depending on where you are in the world . Often you'll want to convert the AC voltage from an outlet to a DC voltage, and that's what a typical DC power supply does. <strong>For example, the 12V wall wart power supply turns the AC voltage from the outlet to 12VDC</strong>.</p>\n<pre>   <img src='https://i.imgur.com/k1Wi5jZ.jpg'/> <div>GFCI protects you from ground path faults</div> </pre> \n<p><em>Electricity can be dangerous, especially to power coming from the wall</em>. Make sure you understand and take responsibility for your actions when working with mains electricity. Power tells us about how much energy we're using in a given amount of time. <strong>It's important to figure out whether we have a good enough heatsink, a big enough power supply, or fat enough wires.</strong> Power equals voltage times current, or P = I x V. Power is measured in Watts, abbreviated with the letter W. So say you have a high power LED with a 30V forward voltage and a 1A forward current. That means the LED dissipates 30W, and you'd need a power supply greater than 30W to drive it. Some of that power gets turned into light, and some of that power gets turned into heat. While LEDs convert a greater proportion of power to light than, say, incandescent bulbs, they still generate plenty of heat that must be heatsinked.</p>\n<h3>Voltage, Current and Ohm's Law</h3>\n<pre> <img src='https://i.imgur.com/c0KIOxJ.jpg'/>  <div>Ohm's law is the law for electricity. It's what relates current to voltage and resistance!</div> </pre>\n<p><strong>Electricity is all about the flow of electrons to transfer energy</strong>. The best way to understand how this works is with the water analogy. Current is like flow; how much electricity is flowing through a circuit, or how much water is flowing through a pipe. Voltage is like pressure; the harder you push, the more flow you get. Resistance limits how much flow you get; a resistor resists the flow of electrons like a skinny pipe resists the flow of water. Ohm's law is the law for electricity. It's what relates current to voltage and resistance. Specifically, voltage equals current times resistance, or V = I x R. For a given resistance (measured in Ohms), the more current you'll get (measure in Amperes, or amps) for a given voltage (measured in volts). You might see these units expressed in units like millivolts or milliamps. These are just prefixes that act like multipliers on the units. For example, a milliamp is one one-thousandth of an amp. Volts are abbreviated with the letter V, amps with the letter A, and Ohms with the greek letter Omega.</p>\n<h3>Electrical Circuits</h3>\n<p>An electrical circuit is a closed conductive path for electrons to flow. <strong>If you connect a wire to both sides of a battery, you've made a circuit.</strong> Current flows from the positive side of the battery, through the wire, back into the battery's negative side. (This is called a short circuit. Don't do this). The most basic electrical circuit is a resistor attached to a voltage source, like a battery. The current through the resistor equals the voltage divided by the resistance, which we know because of Ohm's law. If there are multiple components in a circuit, we can figure out the current and voltage for each part using Kirchoff's laws.</p>\n","o":"4","d":"Learn the fundamental and basic electrical knowledge you need to build a Space Bucket or any DIY indoor garden.","i":[]},{"t":"Emerson (enhancement) Effect","s":"emerson-enhancement-effect","a":"SuperAngryGuy","c":"<p>The Emerson effect is about driving photosynthesis with part of the light PAR (400-680nm in this case), and part of the light far red color (700nm-740nm or so wavelength), <em>which combined can result in photosynthesis rates higher than normal</em>.</p>\n<pre> <img src='https://i.imgur.com/4ge0ohi.jpg'/> <div>Emerson Effect <a href='https://onlinelibrary.wiley.com/doi/am-pdf/10.1111/pce.13730'>(source)</a></div> </pre>\n<p>Robert Emerson used his work with red and far red light to deduce that there must be <strong><a href=\"https://en.wikipedia.org/wiki/Photosystem\">two photosystems</a>, called photosystem I (PSI) and photosystem II (PSII)</strong>. These are named in the order of discovery, but for photosynthesis the process starts with the PSII first.\nMonochromatic light has a sharp drop off in photosynthesis at 680nm or so (red drop effect), but <strong>this does not happen if far red light is added</strong> with about 720nm being most efficient in driving additional photosynthesis.</p>\n<blockquote>\n<p>Adding far-red photons (up to 40%) to a background of shorter wavelength photons <strong>caused an increase in canopy photosynthesis equal to adding 400-700nm photons</strong>. Far-red alone minimally increased photosynthesis. This indicates that far-red photons are equally efficient at driving canopy photosynthesis when acting synergistically with traditionally defined photosynthetic photons.These results suggest that farred photons (701-750 nm) should be included in the definition of photosynthetically active radiation. Shuyang Zhen and Bruce Bugbee, <a href=\"https://onlinelibrary.wiley.com/doi/am-pdf/10.1111/pce.13730\">Far-red photons have equivalent efficiency to traditional photosynthetic photons</a>.</p>\n</blockquote>\n<h3>Key Takeaways</h3>\n<pre> <img src='https://i.imgur.com/SW36L6E.png'/> <div>The Emerson Enhancement Effect</div> </pre>\n<ul>\n<li>Far red light can drive the PSI independently of the PSII, and PAR is more efficient with the PSII while not as well excited with the PSI. Basically how the Emerson effect works is <strong>freeing up electrons between the PSI and PSII</strong> by driving them more efficiently in parallel, and <em>photosynthesis becomes more efficient as a result</em>.</li>\n<li>You can see this <strong>jamming of electrons</strong> in chlorophyll fluorescence shots with proteins associated with the PSII and much less fluorescence associated with the PSI (the single 750nm hump). Higher fluorescence means lower photosynthesis efficiency.</li>\n<li><em>I think most far red driver boards are gimmicks</em> because they are likely not putting out enough far red light to make a noticeable difference.</li>\n</ul>\n","d":"The Emerson effect is about driving photosynthesis with part of the light PAR (400-680nm in this case), and part of the light far red (700nm-740nm or so), combined can result in photosynthesis rates higher than normal.","f":"The Emerson Effect is about driving photosynthesis with <b>PAR light</b> (400-680nm) and <b>far red color</b> (700nm-740nm), which can increase efficiency.","i":[]},{"t":"Equivalent Wattage","s":"equivalent-wattage","a":"SuperAngryGuy","c":"<p>It is important to understand that the light bulbs in your home are rated in wattage equivalent to an incandescent bulb and <strong>don't actually use 100 watts</strong>. For example, a '100 watt' light bulb is around 1600 lumens and a '60 watt' bulb is around 800 lumens.</p>\n<p>The following values are equivalent to an incandescent light bulb (spot and flood lights may be a little different if the manufacturer is using equivalent to halogen lighting). <strong>The watts equivalent does not ever change although the true wattage does as LEDs become more efficient.</strong> This is to help lower the confusion among consumers of what size light bulb they should get. A lot of low end LED sellers will use '600w' or '1000w' as a deceptive marketing practice, and <em>you need to go off by actual wattage</em>. Also, be wary of any 'watts equivalent' to HPS light.</p>\n<ul>\n<li>40 watts equivalent = <strong>~450 lumens</strong></li>\n<li>60 watts equivalent = <strong>~800 lumens</strong></li>\n<li>75 watts equivalent = <strong>~1200 lumens</strong></li>\n<li>100 watts equivalent = <strong>~1600 lumens</strong></li>\n<li>Greater than 100 watts equivalent is not necessarily very well defined</li>\n</ul>\n<h3>Marketing gimmicks</h3>\n<p>A cheap '600w' LED grow light you might find on Amazon or eBay is not drawing anything close to 600 watts, nor is it 600 watt equivalent to anything particularly HPS (high pressure sodium) lighting. <strong>It's a deceptive marketing practice and they will not perform as advertised</strong>. I've seen 50 true watt lights advertised as '600w'. Same with the '1000w' and other lights.</p>\n<p>Also, you can't make a claim like 'a 600w light is really a 100 true watt light' because <strong>the real power draw numbers are all over the place</strong> since there are no real standards. Their cheap LEDs are also going to be significantly less electrically efficient compared to quality grow lights, and they will put out around 40-50% less light per amount of energy usage on top of cheap LEDs tending to not last as long. Do not buy these types of cheap and deceptive lights!</p>\n<p><em>An economic metric you might use is umol/sec per dollar or PPF/dollar.</em> If that '100 watt equivalent' 18.8 umol/sec light bulb is costs $2.50 then 18.8/2.5= 7.52 umol/sec per dollar is the cost of the light. As a comparison, a 1000 HPS consumes 1000 watts and outputs 1800 uMol/sec of light. That 1000 HPS lighting setup costs $200. 1800/200= 9 umol/sec per dollar. The HPS provides 25% more light per dollar than the LED light bulb.</p>\n","d":"The light bulbs in your home are rated in wattage equivalent to an incandescent bulb and don't actually use 100 watts. For example, a '100 watt' light bulb is around 1600 lumens and a '60 watt' bulb is around 800 lumens.","i":[]},{"t":"Green leaves and green light: what's really going on","s":"green-leaves-green-light","a":"SuperAngryGuy","c":"<p>This article challenges the claim that 'plants can't use green light', 'plants are green because they reflect all green light', and other iterations. My counterclaim is <a href=\"/docs/mccree-curve\">the McCree curve</a> used in botany, and every paper on photosynthesis studies by wavelength demonstrates that <em>most plants use green light efficiently</em> (particularly compared to blue light and at higher lighting levels).</p>\n<h3>The claim and my problem with it</h3>\n<pre> <img src='https://i.imgur.com/fgH5Kjj.jpg'/> <div>Leaf penetration by light color <a href='https://www.publish.csiro.au/fp/Fulltext/fp09262?subscribe=false'>(source)</a></div> </pre>\n<p>There is a lot of confusion about <a href=\"/docs/photomorphogenesis\"><strong>how green plants absorb light</strong></a>, and the notion that 'plants can't use green light' or 'plants are green because they reflect all green light'. This confusion comes from biology books that show you a chart for pigments in a solvent or photosynthetic bacteria/algae, and not how higher green land plants actually respond to light.</p>\n<p>This has been used by many <a href=\"https://imgur.com/a/C8LnVXf\"><strong>low end predatory LED grow light sellers</strong></a>, such as making outrageous claims about the photosynthetic performance of red/blue only LED grow lights, by hitting some 'magical wavelengths'. I have seen this claim collectively cause a lot of financial harm to people, and consumers may not be making good choices by thinking the <strong>spectral output of a lower wattage red/blue LED grow light is somehow going to make up for the low lighting levels</strong>: it absolutely will not!</p>\n<h3>The counterclaim (and what's really going on)</h3>\n<p><em>Most green light is absorbed and is used for photosynthesis</em>. Every scientific paper on plant lighting by wavelength for photosynthesis backs the claim that <strong>plants use green light</strong>.</p>\n<p>There is the claim that 'plants are green because they reflect all green light' or that 'plants can't use green light'. <strong>This can be explained with reflectance, absorption, and transmittance</strong>. You are likely going off the <a href=\"https://www.researchgate.net/figure/Chlorophyll-a-b-and-carotenoids-absorbance-spectra_fig1_317151195\">pigments dissolved in a solvent chart</a> if you believe this, and that's a relative absorption chart in vitro (e.g cuvette), not the <a href=\"/docs/mccree-curve\">McCree curve</a> that is an absolute chart of how plant leaves respond to light by wavelength for photosynthesis in vivo (living leaf). There is a pretty big difference here. Also, at no point is chlorophyll in a solvent truly at zero percent absorption of green light in higher resolution charts.</p>\n<p>Unlike chlorophyll in a solvent, <strong>in a green plant leaf we have relatively dense chloroplasts</strong>, containing <a href=\"https://en.wikipedia.org/wiki/Thylakoid\">thylakoid membranes</a> stacked as disks (grana), that holds the cholophyll in a 3D structure called a <a href=\"https://en.wikipedia.org/wiki/Quantasome\">quantasome (basic photosynthesis unit)</a>. There is a much higher density level of chlorophyll in a leaf than chlorophyll in a solvent extract. So in vitro, with just relatively loose pigments suspended in a solvents, <strong>there is going to be a different measurement and spectral characteristics</strong> than in a green leaf in vivo, which is a dense solid lattice that changes optical characteristics (such as broadening the adsorption bands).</p>\n<p>In this example of the <a href=\"https://i.imgur.com/2wgO4GS.jpg\">spectral reflectivity profile of a high nitrogen marijuana leaf</a>, about 90% of the green light is being absorbed.</p>\n<h3>Terashima et al has entered the chat</h3>\n<pre> <img src='https://i.imgur.com/MjTkqON.jpg'/>  </pre>\n<blockquote>\n<p>The intra-leaf light absorption profile is in most cases steeper than the photosynthetic capacity profile. In strong white light, therefore, the quantum yield of photosynthesis would be lower in the upper chloroplasts, located near the illuminated surface, than that in the lower chloroplasts. Because <strong>green light can penetrate further into the leaf</strong> than red or blue light, in strong white light, <em>any additional green light absorbed by the lower chloroplasts would increase leaf photosynthesis</em> to a greater extent than would additional red or blue light. <strong>Ichiro Terashima et al</strong>, <a href=\"https://www.researchgate.net/publication/24043711_Green_Light_Drives_Leaf_Photosynthesis_More_Efficiently_than_Red_Light_in_Strong_White_Light_Revisiting_the_Enigmatic_Question_of_Why_Leaves_are_Green\">Green Light Drives Leaf Photosynthesis More Efficiently than Red Light in Strong White Light</a>.</p>\n</blockquote>\n<p><em>What the team found was the green light started outperforming red light at about 300 uMol/m2/sec</em> as measured with a pulse amplitude modulated fluorometer. Red and blue light gets quickly absorbed by the chlorophyll near the leaf surface, <strong>but green is able to drive photosynthesis deeper</strong>.</p>\n<p>When I see people mentioning this is only for higher white light conditions, then I can tell they have not read the paper. We are looking at net photosynthesis rates in the above paper and that is what really counts, not absolute absorption. Also, <strong>the absorbed green light can transmit deeper through leaf material more effectively</strong> and potentially used for photosynthesis more efficiently.</p>\n<p>This is because the top layers of <a href=\"https://en.wikipedia.org/wiki/Chloroplast\">chloroplasts</a> that contains <a href=\"https://en.wikipedia.org/wiki/Chlorophyll\">chlorophyll</a> becomes saturated (as per <a href=\"https://en.wikipedia.org/wiki/PI_curve\">PI curves</a>), while green light can penetrate deeper into leaf tissue (sieve effect) and reflected around until absorbed by a chlorophyll molecule (scattering) or by an <a href=\"https://en.wikipedia.org/wiki/Accessory_pigment\">accessory pigment</a>. This efficiency can be measured through the amount of <a href=\"https://en.wikipedia.org/wiki/Chlorophyll_fluorescence\">chlorophyll fluorescence</a> or a <a href=\"https://www.google.com/search?q=gas+exchange+chamber&amp;biw=1138&amp;bih=505&amp;tbm=isch&amp;tbo=u&amp;source=univ&amp;sa=X&amp;ei=LI1nVabxI4GfsQWdpoHQDw&amp;ved=0CD0QsAQ\">gas exchange chamber</a>.</p>\n<p>So what high intensity light source has a lot of green light that plants evolved to use? <strong>The sun!</strong> At full sunlight <a href=\"/docs/core-lighting-concepts\">PPFD</a> of around 2000 umol/m2/sec would be considered very intense light compared to what the average indoor grower would use. With thin leaves (e.g. apple) <strong>I can measure perhaps 150 uMol/m2/sec of sunlight through an upper leaf</strong> that will illuminate a lower leaf with nearly all green light (which is a very efficient lighting level for photosynthesis). For more information refer to <a href=\"https://onlinelibrary.wiley.com/doi/pdf/10.1046/j.1365-3040.2000.00563.x\">J. N. Nishio (2000). Why are higher plants green?</a></p>\n<h3>Your eyes can deceive you, don't trust them</h3>\n<pre> <img src='https://i.imgur.com/qo5ZnJ0.jpeg'/> <div>Spectrometer shot of a chlorotic (yellow) leaf</div> </pre>\n<p>Our eyes have a <a href=\"https://en.wikipedia.org/wiki/Photopic_vision#/media/File:CIE_1931_Luminosity.png\">combined sensitivity curve</a> where the peak of our sensitivity is also were the peak reflectivity is going to be for a green plant. So, it's true <strong>plants do reflect more green light than red or blue</strong>, but the way we perceive light is naturally much higher biased for green light with a 555 nm sensitivity peak, which is the same as a green plant's reflectivity peak. This allows use to notice very tiny variations of green which can be use to more precisely diagnose a plant if a gatherer. Coincidence?</p>\n<p>It should be noted that <strong>the maximum absorption wavelength for chlorophyll in leaves in vivo is 675-680 nm (chlorophyll A)</strong>, and not 660 nm as often cited (chlorophyll B is about 645 nm). This can be seen in the spectrometer shot as a dip in the 675-680 nm range from small amounts of chlorophyll A left over. The blue absorption are carotenoids which have perhaps a 30-70% efficiency at transferring the absorbed light energy to a photosynthetic reaction center through chlorophyll A. Depending on the plant, there may be 2.5ish-7 or so chlorophyll A molecules for every chlorophyll B molecule but mostly around a 3:1 ratio.</p>\n<p>The 30-70% efficiency claim (depending on type and the paper) about carotenoids is why I've always thought it is odd that any grow light seller would brag about targeting carotenoids. <em>Carotenoids are there to help the plant with intense lighting</em> and shunting some of the higher energy blue photons absorbed away from chlorophyll.</p>\n<pre> <img src='https://i.imgur.com/47jFDno.jpg'/> <div>Space Bucket with a high power green LED and a pole bean <a href='https://www.reddit.com/r/HandsOnComplexity/comments/28gp4e/space_bucket_with_a_high_power_green_led_and_a/'>(source)</a>. </div> </pre>\n<h3>So... Why not use green LEDs?</h3>\n<p><em>Green LEDs are electrically inefficient compared to red and blue LEDs</em>, and this problem is known as the 'green gap' in physics/engineering. The most efficient green LEDs that I know are actually <strong>blue LEDs with a green phosphor</strong>. That is why white LEDs are used instead that have a strong green light component. <a href=\"https://www.reddit.com/r/HandsOnComplexity/comments/28gp4e/space_bucket_with_a_high_power_green_led_and_a/\"><strong>I've done pure LED green grows</strong></a>, using green COBs in a Space Bucket, and just to prove the point that it can be done.</p>\n<h3>Open access papers on green light and plants</h3>\n<ul>\n<li>Terashima et al. <a href=\"https://www.researchgate.net/publication/24043711_Green_Light_Drives_Leaf_Photosynthesis_More_Efficiently_than_Red_Light_in_Strong_White_Light_Revisiting_the_Enigmatic_Question_of_Why_Leaves_are_Green\">Green Light Drives Leaf Photosynthesis More Efficiently than Red Light in Strong White Light: Revisiting the Enigmatic Question of Why Leaves are Green</a></li>\n<li>Sun et al. <a href=\"https://www.researchgate.net/publication/31345848_Green_Light_Drives_CO2_Fixation_Deep_within_Leaves\">Green Light Drives CO2 Fixation Deep within Leaves</a></li>\n<li><a href=\"https://www.researchgate.net/profile/Thaise-Moriwaki/publication/328414354_Nitrogen-improved_photosynthesis_quantum_yield_is_driven_by_increased_thylakoid_density_enhancing_green_light_absorption/links/5bd3542592851c6b2791f4e7/Nitrogen-improved-photosynthesis-quantum-yield-is-driven-by-increased-thylakoid-density-enhancing-green-light-absorption.pdf\">Nitrogen-improved photosynthesis quantum yield is driven by increased thylakoid density, enhancing green light absorption</a></li>\n<li>Nishio (2000). <a href=\"https://onlinelibrary.wiley.com/doi/pdf/10.1046/j.1365-3040.2000.00563.x\">Why are higher plants green? Evolution of the higher plant photosynthetic pigment complement</a></li>\n<li>Johkan et al. <a href=\"https://www.plantgrower.org/uploads/6/5/5/4/65545169/1-s2.0-s0098847211001924-main.pdf\">Effect of green light wavelength and intensity on photomorphogenesis and photosynthesis in Lactuca sativa</a></li>\n<li>Wang, Folta. <a href=\"https://www.researchgate.net/publication/234029403_Contributions_of_green_light_to_plant_growth_and_development\">Contributions of green light to plant growth and development</a></li>\n<li><a href=\"http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2807594/\">Cost and Color of Photosynthesis</a> - Why plants evolved green.</li>\n<li><a href=\"https://digitalcommons.usu.edu/etd/4613/\">Effects of Blue and Green Light on Plant Growth and Development at Low and High Photosynthetic Photon Flux</a> - Master Thesis</li>\n<li><a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0163121\">Sensitivity of Seven Diverse Species to Blue and Green Light: Interactions With Photon Flux</a></li>\n<li><a href=\"https://www.researchgate.net/profile/Yihai-Wang-3/publication/273916681_Green_light_augments_far-red-light-induced_shade_response/links/564c966308aeab8ed5e9fe25/Green-light-augments-far-red-light-induced-shade-response.pdf\">Green light augments far-red-light-induced shade response</a></li>\n<li><a href=\"https://www.tandfonline.com/doi/pdf/10.4161/psb.7.1.18635\">Green light signaling and adaptive response</a></li>\n<li><a href=\"https://www.researchgate.net/profile/Robert-Griffin-Nolan/publication/328104902_Green_light_drives_photosynthesis_in_mosses/links/5bb7929e92851c7fde2f19bd/Green-light-drives-photosynthesis-in-mosses.pdf\">Green light drives photosynthesis in mosses</a></li>\n<li><a href=\"https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/pce.13643\">Cryptochromes integrate green light signals into the circadian system</a></li>\n</ul>\n","o":"3","d":"This article challenges the claim that 'plants can't use green light', 'plants are green because they reflect all green light', and other iterations. My counterclaim is the McCree curve used in botany, and every paper on photosynthesis studies by wavelength ","i":[]},{"t":"Heat Control","s":"heat-control","a":"ekrof","c":"<p>A common problem with small enclosed gardens is high temperatures. Space Buckets can suffer from these problems, <strong>but there are many solutions available for high heat bucketeers.</strong> A proper lighting configuration and airflow design are essential for solving these issues.</p>\n<pre>  <img src='https://i.imgur.com/bQhWnTu.jpg'/> <div>CFL bulbs run hotter than LED alternatives</div> </pre> \n<p><em>A thermometer is an indispensable tool when trying to solve heat issues</em>. These devices are tiny, and can fit without problems inside the bucket. It is best to take more than one reading for more accurate results: <strong>the temperature will vary in the canopy and other areas of the growth chamber</strong>.</p>\n<p>Most thermometers also include a humidity sensor, which can be an important factor in the performance of the plant. <strong>If the ambient temperature is already high, the bucket will naturally struggle with heat issues</strong>. A good strategy when dealing with high ambient temperatures is to <strong>schedule the bucket to run on the night</strong>, which is naturally colder. Electrical rates are usually cheaper during this time!</p>\n<h3>Lighting Issues</h3>\n<p><em>The main source of heat in any indoor garden comes from the lighting configuration</em>. This is the disadvantage of using higher-wattage <a href=\"https://amzn.to/3jMfTYw\">CFL bulbs</a>: they have their ballast incorporated and inside the bucket. Going over 130w of CFL in a 5gal bucket is known to cause heat issues. Supersized builds can support a bit more, but as a general rule, between 4 and 6 <a href=\"https://amzn.to/3jMfTYw\">CFL bulbs</a> is the recommended limit. LED lights don't usually present heat issues, but that also depends on the particular installation. The most important thing to consider is to <strong>keep the heatsinks on the outside of the bucket.</strong> With <a href=\"https://amzn.to/36NO5zr\">UFO LED light</a>, this can be achieved as simply as placing the LED on top of the lid.</p>\n<ul>\n<li><a href=\"/docs/lighting-solutions\">Learn more about lighting alternatives »</a></li>\n</ul>\n<h3>Airflow Issues</h3>\n<pre> <img src='https://spacebuckets.com/u/ekrof-ufo-led/2c3234.jpg'/> <div>Keeping the UFO on the outside of the container is better for thermal management</div> </pre>\n<p>Most of the heating problems in a SB <em>can be tracked back to an improper airflow configuration</em>. The amount of ventilation needs to be proportional to the power of the main lighting, and specially so when using <a href=\"https://amzn.to/3jMfTYw\">CFL bulbs</a>. A minimum of 2 PC fans is recommended for 5gal builds, one exhaust and one intake. As heat rises, the exhaust works better on top of the bucket. An active intake blowing directly on the bulbs can lower their temperature drastically; for this reason, 3 PC fans are usually recommended when growing plants with bulbs.\nBuilds with <a href=\"https://amzn.to/36NO5zr\">UFO LED lights</a> don't usually have heat issues, <strong>specially if the light is kept outside of the bucket</strong>. UFOs include a fan that keeps it mostly cool. That being said, UFO buckets still need proper airflow with at least 1 PC fan for intake. Humidity issues may appear if there is poor airflow.</p>\n<ul>\n<li><a href=\"/docs/airflow-solutions\">Learn more about airflow alternatives »</a></li>\n</ul>\n","o":"7","d":"A common problem with small enclosed DIY gardens is controlling high temperatures. A proper lighting configuration and airflow design are essential for solving these issues.","i":[]},{"t":"LED Bulbs","s":"led-bulbs","a":"ekrof","c":"<p><strong>LED bulbs can be used for Space Buckets, and they are a good replacement for standard <a href=\"https://amzn.to/3jMfTYw\">CFL</a> builds.</strong> The main advantage of <a href=\"https://amzn.to/3lyKIRa\">LED bulbs</a> is that you can keep the heatsink on the outside, avoiding many heat problems. They also have better electrical efficiency and are commonly cheaper than equivalent <a href=\"https://amzn.to/3jMfTYw\">CFL bulbs</a>.</p>\n<pre> <img src='https://spacebuckets.com/u/ekrof-led/c0a983.jpg'/> <div>A glass shield is an important safety feature</div> </pre>\n<h3>Types of LED bulbs and Safety</h3>\n<p>For better results, you can to remove the protective cap on top of the bulb to take advantage of LEDs unidirectional light output, as the cap will diffuse the light in different directions. Make sure the LEDs are all pointing the same way.</p>\n<p><em>But an important note on safety</em>: When removing the cover or diffuser on an LED lamp, <strong>you may be exposing yourself to very unsafe DC voltage.</strong> Count the LED's. If there are more than 20 LED's then you should probably think about using a different brand of LED. This is because the SMD LED's commonly used in LED e27 lightbulbs use about 3v. Wired in series, the string could require upwards of 60vDC. Although this voltage may be safe, you are quickly approaching the range of voltage that can pass current through the human body. This is regardless of AC or DC.</p>\n<ul>\n<li><a href=\"https://www.reddit.com/r/HandsOnComplexity/comments/fasuw9/a_strong_warning_about_removing_the_domes_from/\">Read more on LED bulb safety on /r/HandsOnComplexity</a></li>\n</ul>\n","o":"10","d":"LED bulbs can be used to grow all kinds of plants indoors. Space Buckets are a great fit for these lighting option.","i":[]},{"t":"LED Heat Sinks","s":"led-heat-sinks","a":"SuperAngryGuy","c":"<p>Only the energy input not radiated as light needs to be taken in to account for LED heat sink calculations. <em>This is called thermal wattage.</em> For example, a 100 watt COB that is 50% efficient would need a heat sink good for 50 watts of heat. A 100 watt COB that is 80% efficient would need a heat sink good for 20 watts of heat.</p>\n<pre> <img src='https://i.imgur.com/TjFMmCu.jpg'/> <div>Duct around a heat sink with a heat source on its base.  <a href='https://en.wikipedia.org/wiki/File:Heat_sink_control_volume.png'>(source)</a></div> </pre>\n<p>A heat sink has a <em>thermal rating</em> or heat dissipation in units of °C/W, or the rise of the heat sink in degrees C per watt of heat on the heat sink. If I have a 100 watt COB that is 50% efficient (so 50 watts of heat) and want the heat sink to rise no more than 10°C, I would need a heat sink with a heat dissipation of 0.2 °C/W. If I use a fan it may be 0.4 to 2 °C/W, depending on how much air the fan pushes and the particular heat sink geometry.</p>\n<p>I often size heat sinks that <em>prevent the LEDs from going above 85-125 C for safety</em>, and then use a quite fan to keep them at a temperature I want them to be. This provides an inherent fail-safe feature when experimenting.My personal do not go over temperature is 145°F (63°C), or where I can keep my finger on the heat sink for an honest one second. For a Vero 29 running at 120 watts <strong>I use a generic $30 CPU cooler with a fan</strong> and call it good. I've seen coolers half that price that should also work.</p>\n<h3>Usage Tips</h3>\n<p><strong><a href=\"https://en.wikipedia.org/wiki/6063_aluminium_alloy\">6063 aluminum alloy</a> is the alloy with the highest thermal conductivity</strong> (around 210 W/m⋅K), and most common in heat sinks. The trade off is that 6063 is a softer alloy so common 6061 alloy (around 167 W/m⋅K) may be used instead in some cases. I've seen sellers advertise about using 'aircraft grade aluminum' like 7075 alloy for metal core PCBs for LEDs, which is inferior for our uses (around 140 W/m⋅K). For comparison, copper is closer to 400 W/m⋅K, and steel is closer to 45 W/m⋅K.</p>\n<p>It is critically important that a <em>thermal compound paste or thermal adhesive</em> is used between the LED and the heat sink. You only want a thin layer, and I always twist the LED around a bit to get rid of air bubbles and get better overall thermal contact. If it's a heat sink/LED I'll never reuse then I'll use a thermal adhesive and just glue the LED down. Thermal pads can work at lower power levels but won't work as well as a compound/adhesive.</p>\n<p>When <strong>making mounting holes</strong> in a heat sink you can use a stainless steel screw as a tap. Drill a whole just smaller than the diameter of the screw, force the screw in to the much softer aluminum cutting the threads in the process (I use a ratcheting screwdriver for this), back the screw out, take a fine file and smooth out the burs completely, and you have a drilled and tapped mounting hole.</p>\n<h3>Temperature Measuring</h3>\n<p>When working with a heat sink and a constant current power supply, you can monitor the voltage on the LEDs to see very tiny temperature variations that might not normally be measured with a temperature probe. With a constant voltage power supply, you can monitor the current to see very tiny temperature variations. This is because the I/V curves for LEDs are temperature dependent, and strings of LEDs make very high resolution temperature sensors. I use a 50,000 count data logging Fluke 287 for this purpose (I recommend a 6000 count multimeter for lower cost DIY. Every low cost meter I've ever tested reads within their listed specs when referenced to my Fluke 287, except for the occasional generic $5 meter that companies like Harbor Freight give away for free).</p>\n","o":"3","d":"I often size heat sinks that prevent the LEDs from going above 85-125 C for safety, and then use a quite fan to keep them at a temperature I want them to be. This provides an inherent fail-safe feature when experimenting.","i":[]},{"t":"LED Power Supplies","s":"led-power-supplies","a":"SuperAngryGuy","c":"<p>Power supplies have historically been the weak link in an LED grow light system and <strong>cheap capacitors are the main issue</strong>. The cheap boost converters you can buy on Amazon and eBay will work, but don't expect more than about 6 months use out of them. Again, it's the capacitors that tend to fail.</p>\n<pre> <img src='https://i.imgur.com/lhB50hG.jpg'/> <div>XLG Series Mean Well Power Supply</div> </pre>\n<p>Get a Mean Well LED driver for your DIY projects.<strong><a href=\"https://amzn.to/3sYoSeH\">The XLG series</a> are constant power and work quite well with a Vero 18 or 29.</strong> The nice thing about that configuraion is that a Vero 18 or 29 can be quickly interchanged at the same power level so you can rapidly measure the differences between the two if needed.</p>\n<p><em>External LED drivers keep you off line voltage</em> which is the compelling reason to use them for DIY use. The better ones are <a href=\"https://www.pcscsecurity.com/wp-content/uploads/2018/04/ULversusUR_PCSC.pdf\">'UR' marked</a>, with a reverse 'UR', which means it has been tested for safety for a factory install component of an electrical device (as opposed to a UL marking for a field install of a complete electrical device although there are plenty of ANSI/UL 8750 listed LED drivers).</p>\n<p>I often use <a href=\"https://amzn.to/2WAllHI\">lab power supplies</a> as my LED drivers. If you only get one lab power supply make sure it's a linear power supply and not a noisy switching power supply. <strong>Lower cost linear power supplies typically have a fan</strong> that will turn on at certain current levels while more expensive and much heavier ones are entirely passive cooled.</p>\n","d":"Power supplies have historically been the weak link in an LED grow light system and cheap capacitors are the main issue. The cheap boost converters you can buy on Amazon and eBay will work, but don't expect more than about 6 months use out of them.","i":[]},{"t":"LED Side Lighting","s":"led-sidelighting","a":"ekrof","c":"<p>A very important kind of lighting for bucket gardening are LED strips, which <strong>can be installed on the walls of the container as a supplemental source of lumens.</strong> These SMD LEDs (Surface-Mount Device) are not powerful enough to act as the main lighting, but <strong>they provide sufficient energy to make a difference for the plant.</strong> This is specially useful for crowded buckets, as the sidelighting penetrates below the top canopy. LED strips are a cheap and always recommended upgrade for any bucketeer.</p>\n<h3>LED strip types</h3>\n<pre> <img src='https://spacebuckets.com/u/vanr/d0ba96.jpg'/> <div>5gal are the smallest size for Space Buckets</div> </pre>\n<p>There are many types of SMD LEDs: <em>for Space Buckets, 5050, 5630 and 7020 chips are recommended</em>, while 3528 should be avoided. The <a href=\"https://amzn.to/30TZOZn\">5630SMD LED</a> offer the best heat to lumen ratio, and are much brighter than the <a href=\"https://amzn.to/30OqRW0\">5050SMD strips</a>. Meanwhile, 7020 chips are harder to find and less reliable, with a higher heat footprint. All of the LED strips can be purchased in waterproof and non-waterproof variants. For SB, the waterproof strips are the most durable and recommended.</p>\n<h3>Single chips</h3>\n<p>Single LED chips can also be used for Space Bucket sidelighting: <strong>an array of 1w or 3w LEDs can provide an interesting alternative to SMD strips</strong>. This solution is usually harder to install, but more effective in the long run. With these kind of LEDs, it is always a good idea to keep the heatsinks on the outside of the growing container.</p>\n","o":"6","d":"A very important kind of lighting for DIY gardening are LED strips, which are installed on the walls as a supplemental source of lumens.","i":[]},{"t":"Lighting Solutions","s":"lighting-solutions","a":"ekrof","c":"<p>The Light-Top is the heart of a Space Bucket. <strong>It contains the main lighting configuration, and as such determines the performance of the indoor garden.</strong> If the light-top is underpowered, plants will grow long and thin which makes it unstable; if it is overpowered, heat and photosynthesis issues will be common (there is such thing as too much light for a plant). A light-top can be made with either <a href='https://amzn.to/3jMfTYw'>CFL</a> or LED lighting.</p>\n<pre> <img src='https://spacebuckets.com/u/ekrof/191c18.jpg'/> <div>An array of CFL bulbs with glass shielding</div> </pre>\n<h3>CFL lighting</h3>\n<p><em>Compact Fluorescent Lights are the cheapest option, but also the hardest to optimize</em>. <strong><a href='https://amzn.to/3jMfTYw'>CFL bulbs</a> emit a lot of heat that needs to be extracted from the plant chamber</strong>, and because of that, extra airflow is needed. The best CFL bulbs for Space Buckets are the 23 and 42 watt versions, which feature a good balance between heat and lumen output. Bulbs over 42w can be a safety hazard in an enclosed container, while bulbs under 23w are not an effective option.</p>\n<p><strong>LED lighting is the present and future of Space Buckets</strong>. This technology has a smaller heat footprint, something essential for indoor bucket gardening. These lights also have a higher lumen per watt output. There are two main LED options for bucket gardening: traditional bulbs (with E27 sockets), to UFO style fixtures.</p>\n<ul>\n<li><a href=\"/gallery/1/cfl\">View over 135 CFL build examples in the Gallery »</a></li>\n</ul>\n<h3>UFO LED</h3>\n<pre> <img src='https://spacebuckets.com/u/adnatop/2a180e.jpg'/> <div>A typical UFO LED light</div> </pre>\n<p><em>The best option for LED Space Buckets are <a href='https://amzn.to/36NO5zr'>UFO LED grow lights</a></em>, which come in a round shape that fits a bucket perfectly. With this option, it is just a matter of putting the light on top of the lid and plugging it into the wall. <a href='https://amzn.to/36NO5zr'>UFO LED grow light</a> are the <strong>plug and play solution for Space Buckets</strong>.</p>\n<p>These lights can be found in a variety of wattages. For the classic Space Bucket with 5gal containers, a <a href='https://amzn.to/36NO5zr'>135w UFO LED light</a> is enough. For supersized builds that feature 10gal containers, 180w are a better option. For Space Buckets that use stacked tote, a 300w UFO will be essential. As a general rule of thumb, the bigger the container, the more wattage will be needed for optimal results.</p>\n<p>Some bucketeers install the UFO inside the container, which is not recommended and usually requires the reversal of the light fans. Though this is a viable option, <strong>it is better to install the UFO light outside of the container</strong>, which keeps the heat away from the growing chamber.</p>\n<ul>\n<li><a href=\"/gallery/1/ufo\">View 161 UFO build examples in the Gallery »</a></li>\n</ul>\n<h3>LED Bulbs</h3>\n<p><em><a href='https://amzn.to/3lyKIRa'>LED bulbs</a> have become an interesting option</em> for budget-minded bucketeers. <strong>The best bulbs for these kind of buckets are 8.5 to 10w.</strong> A LED-bulbed SB can be made following a SAG style build blueprint. In this case, 4 or 5 bulbs are installed vertically on the bucket lid. The plastic covers can be removed to optimize the bulbs lumen output, but for some newer models that is not recommended. <strong>For safety reasons, if the bulb has over 20 LEDs inside, it is better to keep the cover in place.</strong>\nOne solution to the <a href=\"/docs/led-bulbs\">problems caused by the uncovered LED bulbs</a> is to install a <strong>heat shield</strong>, which is fitted between the lights and the plant chamber. This is an essential upgrade for buckets that have high temperatures, and a great way to cover the exposed parts of the light fixture. The preferred material for heat shields is glass, which can be custom cut and stays cold to the touch. Acrylic or plexiglass can also be used, but is has to be monitored more closely (acrylic can melt or warp under high heat conditions).</p>\n<ul>\n<li><a href=\"/gallery/1/ledbulb\">View 19 LED bulb build examples in the Gallery »</a></li>\n<li><a href=\"/docs/led-bulbs\">Read more about LED bulb safety »</a></li>\n</ul>\n","o":"2","d":"The Light-Top is the heart of a Space Bucket. It contains the main lighting configuration, and determines the performance of the indoor garden.","i":[]},{"t":"Luminous efficacy","s":"luminous-efficacy","a":"SuperAngryGuy","c":"<p>It's easy to get <strong>'efficacy' (how well something works)</strong> and <a href=\"/docs/luminous-efficiency\">'efficiency' (ratio of useful work)</a> confused. As we'll see, knowing this difference helps us make LED efficiency calculations and understand why red LEDs are used in grow lights.</p>\n<pre> <img src='https://i.imgur.com/3i1MYgX.jpg'/> <div>Luminous efficacy of pure blackbody radiation as a function of temperature</div> </pre>\n<blockquote>\n<p>As lighting efficiency improves, it is useful to understand the theoretical limits to luminous efficacy for light that we perceive as white. Independent of the efficiency with which photons are generated, <strong>there exists a spectrally imposed limit to the luminous efficacy of any source of photons</strong>. We find that, depending on the acceptable bandpass and—to a lesser extent—the color temperature of the light, <strong>the ideal white light source achieves a spectral luminous efficacy of 250–370 lm/W</strong>. Thomas W. Murphy, <a href=\"https://tmurphy.physics.ucsd.edu/papers/JAP_111_104909.pdf\">Maximum spectral luminous efficacy of white light</a></p>\n</blockquote>\n<h3>Key Efficacy Concepts</h3>\n<p>The following points mean that we can theoretically get about 47% more light for the energy input with 660nm LEDs versus 450nm LEDs. It explains why red LEDs are breaking the 4 µmol/joule barrier, and white LEDs based on blue LEDs with a phosphor never will. Green LEDs are electrically inefficient and is a physics/semiconductor issue (our eyes are most sensitive to green light so we don't notice).</p>\n<pre> <img src='https://i.imgur.com/teNXDG5.jpg'/> <div>Comparison of various light source technology's luminous efficacy (<a href='https://www.researchgate.net/figure/Comparison-of-various-light-source-technologys-luminous-efficacy-4_fig1_286570536'>source</a>)</div> </pre>\n<ul>\n<li><strong>1240/wavelength of light in nanometers</strong> = energy of a photon in eV (electron volts).</li>\n<li><strong>10.37/eV of photon</strong> = µmol/joule or the maximum possible PPE (photosynthetic photon efficacy).</li>\n<li><em><strong>Max possible PPE * LED efficiency</strong> = the PPE for the specific LED</em></li>\n<li><strong>Example:</strong> 660nm photon. (1240/660=1.88eV) (10.37/1.88=5.52 µmol/joule). At 100% efficiency, a red 660nm LED would have a PPE of 5.52 µmol/joule.</li>\n<li><strong>Example:</strong> 450nm photon. (1240/450=2.76eV) (10.37/2.76=3.76 µmol/joule). At 100% efficiency, a blue 450nm LED would have a PPE of 3.76 µmol/joule.</li>\n<li><strong>Question:</strong> what is the electrical efficiency of a 660nm LED with a PPE of 2.8 µmol/joule? (1240/660=1.88eV) (10.37/1.88=5.52 µmol/joule) (2.8 µmol/joule/5.52 µmol/joule=50.7% efficient)</li>\n<li><strong>Question:</strong> what is the electrical efficiency of a 450nm LED with a PPE of 2.8 µmol/joule? (1240/450=2.76eV) (10.37/2.76=3.76 µmol/joule) (2.8 µmol/joule/3.76 µmol/joule=74% efficient)</li>\n</ul>\n","d":"It's easy to get 'efficacy' (how well something works) and 'efficiency' (ratio of useful work) confused. As we'll see, knowing this difference helps us make LED efficiency calculations and understand why red LEDs are used in grow lights.","f":"As lighting efficiency improves alongside LED technology, it <b>is useful to understand the theoretical limits</b> to luminous efficacy for lights.","i":[]},{"t":"Luminous efficiency","s":"luminous-efficiency","a":"SuperAngryGuy","c":"<p>Luminous efficiency is <strong>a percentage correction factor for wavelengths of light</strong> (relative to 555nm) that takes in to account the spectral sensitivity of the human eye. 555nm is what our eyes are most sensitive to and has a luminous efficiency of 1.0002 (it had to be corrected once which is why it's not 1.0000, that's good science!).</p>\n<p>It is important to note that luminous efficiency is not the same as <a href=\"/docs/luminous-efficacy\">luminous efficacy (lumens per watt)</a>. Generally speaking, sfficiency is the ratio of useful work: for example, <strong>an LED is 50% efficient if half the consumed energy is radiated away as the light</strong>. Efficacy, as how I'm using it, is how well something works: for example, that white 50% efficient LED at CRI 80 has a luminous efficacy of around 160 lumens per watt.</p>\n<h3>Wavelengths and Efficiency</h3>\n<pre> <img src='https://i.imgur.com/SJwYfJr.jpeg'/> <div>Transmission characteristics of the filter for a <a href='https://amzn.to/3BlCiEr'>Dr.Meter LX1010B lux meter</a></div> </pre>       \n<p>LEDs have a binning tolerance, and a 660nm LED could actually be 650nm or 670nm. A 650nm LED has a luminous efficiency of 0.107, while a 670nm LED has a luminous efficiency of 0.032. <strong>That means with a lux meter the 650nm LEDs with give a lux reading three times higher than 670nm LED although the PPFD may be the same.</strong> This is why we don't use lux meters with color LEDs for absolute measurements, and why knowing about luminous efficiency is important. A <a href=\"https://amzn.to/3Dtck3J\">cheap $10 spectroscope</a> can help you identify that actual dominate wavelength of an LED so you can determine the needed correction factor.</p>\n<p><em>A lux meter with cosine correction can be used accurately with any visible lighting spectrum for relative measurements</em>. The cheap $20 lux meters I examined where using silicon diodes with an appropriate short pass filter. This, combined with the response curve of a generic silicon photodiode, gets fairly close to a true lux curve response that a spectroradiometer can give that takes into account the luminous efficiency by wavelength.</p>\n<h3>Efficiency Examples</h3>\n<p>If we know that the white light coming from the bulb with a CRI of 80 has a theoretical maximum efficacy of 320 lumens per watt and our light is rated for 110 lumens per watt, <strong>then the bulb is 34% efficient</strong>. If the light bulb is using 450nm blue LEDs as a phosphor pump source, and the maximum theoretical efficacy of a 450nm photon is 3.76 umol/joule, <strong>then we know that the light is putting out 1.28 umol/joule of light</strong>. The light will be drawing 14.5 watts (1600 lumens light output / 110 lumens per watt) giving a total PPF of 18.8 umol/sec of light. If that 18.8 umol/sec of light is spread evenly over a square meter of plant canopy then the average light intensity in the square meter will have a PPFD of 18.8 umol/m2/sec.</p>\n","o":"3","d":"Luminous efficiency is a percentage correction factor for wavelengths of light (relative to 555nm) that takes in to account the spectral sensitivity of the human eye. 555nm is what our eyes are most sensitive to and has a luminous efficiency of 1.0002.","i":[]},{"t":"Rough lux lighting levels","s":"lux-lighting-levels","a":"SuperAngryGuy","c":"<p><strong>There are several different 'ideal' levels of light intensity, depending on the stage of growth your plant is in.</strong> The following information is useful when figuring out how much 'headroom' you need, or distance between your light source and the canopy of your plant (many people use 'bucket spacers' to gain distance). Lux meters in general should only be used for white light, not mixed/monochromatic light sources (for example, 660nm red LED, 440nm blue LED). Be sure to always measure from the top of the canopy.</p>\n<p>These measurements correspond to a <strong>white light LED CRI 80</strong> (in this case 70 lux is equal to 1 µmol/m2/sec):</p>\n<ul>\n<li><strong>5,000 lux</strong> = unrooted cuttings (you don't want too much light)</li>\n<li><strong>15,000 lux</strong> = lower end for seedlings (common microgreen level)</li>\n<li><strong>25,000 lux</strong> = lower end for vegetative growth</li>\n<li><strong>40,000 lux</strong> = lower end for flowering</li>\n<li><strong>75,000 lux</strong> = this starts to hit light saturation</li>\n</ul>\n<p><em>These values is only valid for white light.</em> Except for unrooted cuttings, you want to stay above these numbers. I've grown seedlings fine at 35klx, and many people on <a href=\"https://reddit.com/r/SpaceBuckets/\">the /r/SpaceBuckets subreddit</a> are running their plants at &gt;75klk or equivalent. <strong>You really want to stay above 40klx for flowering, and many professionals are going to be closer to 75-90klx</strong>. I tend to grow plants at higher lighting levels myself. As a general rule, if your seedlings are 'stretching' then you need more total light or a higher color temperature light.</p>\n","d":"There are several different 'ideal' levels of light intensity, depending on the stage of growth your plant is in. The following information is useful when figuring out how much 'headroom' you need, or distance between your light source and the canopy of your plant","i":[]},{"t":"Lux meters, quantum light meters, and spectrometers","s":"lux-meters","a":"SuperAngryGuy","c":"<p>A <strong>quantum light meter</strong> is called 'quantum' because their measurement is in the amount a photons hitting a specific point in space per second and a photon is a quanta of light. <strong>A lux meter</strong> is called 'lux' since they measure luminous flux.</p>\n<pre> <img src='https://i.imgur.com/FYH1jRa.jpg'/> <div>Spectral response curve</div> </pre>\n<p><em>Lux meters try to get this spectral response curve (the black curve)</em> and typically use an inexpensive silicon photodiode with a particular filter that rolls off the red end. The photodiode naturally has a blue roll off and this, with economy of scale, allows pretty accurate meters to be made cheaply compared to quantum light meters. That filter is just a cheap greenish piece of plastic with this spectral response.</p>\n<p><strong>The high end quantum light meters use a silicon diode</strong> with a very expensive spectral response flattening curve and A thin film optical band pass filter to only read 400-700nm light evenly. That's why there is a big price jump in meters prices. These meters also use a digital smoothing filter so the readings aren't bouncing all over the place. <strong>If you're serious about lighting you'll get a full spectrum quantum light meter.</strong></p>\n<h3>Recommended Meters</h3>\n<p>For red/blue 'blurple' lighting and for professional or academic use for all lighting, I recommend either the <a href=\"https://amzn.to/3DoAOv1\">Apogee MQ-500 quantum light meter</a> or the <a href=\"https://amzn.to/3mFcYFp\">Apogee SQ-520 quantum light sensor</a>. If that is not an option, the Dr.Meter lux meters may be a good alternative, like the <a href=\"https://amzn.to/2UXW5dH\">1330B-V</a>. <strong>For pro/academic use or advanced hobby use, get the MQ-500</strong> if you are doing more field use, get the SQ-520 if you are doing more lab use and don't need to be portable.</p>\n<p>According to <strong>Bruce Bugbee</strong>, founder of <a href=\"https://www.apogeeinstruments.com/\">Apogee Instruments</a> and the Director of the Crop Physiology Laboratory at <a href=\"https://caas.usu.edu/labs/cpl/\">Utah State University</a>, <em>your light meter should never have more than a 5% error over 400-700nm</em> for academic purposes. A lux meter should keep you within 10% error for most white light sources (as per my testing), as long as a rough conversion value is known.</p>\n<pre> <img src='https://i.imgur.com/6Upfidy.jpg'/> <div>Apogee MQ-500 quantum light meter</div> </pre>\n<p>Quantum light meters and lux meters are basically worthless for far red lights and far red LEDs. <strong>For those you need a spectrometer</strong>, a far red sensitive spectral sensor, or something like an Apogee SQ-620 which is PAR and far red sensitive. Red/far red sensors for microcontrollers start at about $25.</p>\n<p>Do not use a <strong>cheap analog lux meter</strong>. I've tested one type and it was way off (the analog ones had impedance matching problems with the analog scale so were giving bad readings in brighter light). These cheap 3 in 1 light meters, pH meters, and moisture meters are worthless.</p>\n<h3>Usage tips</h3>\n<p>You generally want the <strong>light meter pointing up and down, not at the light source, to get a cosine correct reading</strong>. This is a huge mistake I see people make: the white piece of plastic over the sensor gives the proper cosine correction, but not tilting the sensor towards the light will give false readings.</p>\n<p>You can calibrate any light meter for PPFD as long as the meter has cosine correction. Most light meters are highly linear; a light meter based on a light dependent resistor would likely not be linear, but silicon diodes are linear to within 1% over 7-10 orders of magnitude.</p>\n<p><em>Your phone is a poor light meter if it has no cosine correction</em> (highly likely does not). I can set up conditions where my Samsung A51 (and Samsung S7) are ten times off a true reading. This is a hardware limitation that can not be corrected with an app. Phones are basically worthless for color LEDs due to the luminous efficiency issue. Based on hands-on experience, I automatically discount all lux measurements done with phones.</p>\n","d":"A quantum light meter is called 'quantum' because their measurement is in the amount a photons hitting a specific point in space per second and a photon is a quanta of light. A lux meter is called 'lux' since they measure luminous flux.","i":[]},{"t":"Lux to PPFD conversions","s":"lux-ppfd-conversion","a":"SuperAngryGuy","c":"<p><em>I've tested dozens of LEDs with my spectroradiometer to get these numbers to always be within 10%.</em> These are true measurements and not tied to any specific lux meter. The claims are also backed by peer reviewed literature that uses <strong>67 lux = 1 µmol/m2/sec as a generalization</strong> for all white LEDs and not taking CRI into account. The following conversions will get you within 10% for white light.</p>\n<ul>\n<li><strong>55 lux</strong> = 1 µmol/m2/sec (sunlight)</li>\n<li><strong>63 lux</strong> = 1 µmol/m2/sec (white light - CRI 90)</li>\n<li><strong>70 lux</strong> = 1 µmol/m2/sec (white light - CRI 80)</li>\n<li><strong>80 lux</strong> = 1 µmol/m2/sec (HPS)</li>\n</ul>\n<pre> <img src='https://i.imgur.com/WYulYES.jpg'/> <div>Comparing different lighting spectrums</div> </pre>\n<blockquote>\n<p>Dependencies have been shown and conversion factors have been determined, which <strong>allow to estimate PPFD, YPFD and radiometric power density of white LED light</strong> according to the known illumination in lux. The most adequate estimation of the photosynthetically active white light flux is achieved if one measures the illumination E in kilolumens using a luxmeter, neglects the influence of spectral parameters, and <em>estimates the PPFD of white LED light according to the formula: PPFD (μmol/s/m2) = 15·E (klx)</em>. Anton Sharakshane, <a href=\"https://www.biorxiv.org/content/biorxiv/early/2018/03/30/289280.full.pdf\">An easy estimate of the PFDD for a plant illuminated with white LEDs</a></p>\n</blockquote>\n<h3>Bridgelux phosphor guide</h3>\n<p>This section covers spectrum charts, conversion factors, and color ratios of the Bridgelux COB array LEDs. <strong>The conversion factor is luminous flux (lux) to photosynthetic photon flux density (PPFD) in uMol/m2/sec (micro moles per square meter per second) of PAR (photosynthetic active radiation 400-700nm)</strong>. This is so that low cost lux meters can be used as plant lighting meters. The color ratios will not add up to 100. Blue is 400-499nm, green is 500-599nm, red is 600-699nm, far red is 700-799nm. The average wavelength of phosphor pump blue LEDs in my samples was about 453.5nm.</p>\n<table> <tr> <th>Bridgelux LED</th> <th>Conversion factor</th> <th>Color ratio</th> <th>Spectrum chart</th> </tr> <tr> <td>2000K CRI 65</td> <td>70 lux = 1 uMol/m2/sec</td> <td>blue: 05 </br> green:41 </br> red:49 | far red: 02</td> <td><img src='https://i.imgur.com/cmu9pWD.jpeg'/></td> </tr> <tr> <td>2700K CRI 80</td> <td>72 lux = 1 uMol/m2/sec</td> <td>blue: 11 </br> green: 42 </br> red: 36 | far red: 02</td> <td><img src='https://i.imgur.com/s1oh0rG.jpeg'/></td> </tr> <tr> <td>2700K CRI 90</td> <td>63 lux = 1 uMol/m2/sec</td> <td>blue: 06 </br> green: 19 </br> red: 22 | far red: 02</td> <td><img src='https://i.imgur.com/aaGi27J.jpeg'/></td> </tr> <tr> <td>3000K CRI 80</td> <td>73 lux = 1 uMol/m2/sec</td> <td>blue: 16 </br> green: 45 </br> red: 37 | far red: 02</td> <td><img src='https://i.imgur.com/RdVtIFz.jpeg'/></td> </tr> <tr> <td>3000K CRI 90</td> <td>65 lux = 1 uMol/m2/sec</td> <td>blue: 09 </br> green: 22 </br> red: 23 | far red: 02</td> <td><img src='https://i.imgur.com/U4l78mc.jpeg'/></td> </tr> <tr> <td>3000K CRI 97</td> <td>59 lux = 1 uMol/m2/sec</td> <td>blue: 14 </br> green: 36 </br> red: 41 | far red: 04</td> <td><img src='https://i.imgur.com/mdBTbJM.jpeg'/></td> </tr> <tr> <td>3500K CRI 80</td> <td>74 lux = 1 uMol/m2/sec</td> <td>blue: 20 </br> green: 47 </br> red: 31 | far red: 01</td> <td><img src='https://i.imgur.com/FYt9WCU.jpeg'/></td> </tr> <tr> <td>4000K CRI 80</td> <td>74 lux = 1 uMol/m2/sec</td> <td>blue: 11 </br> green: 24 </br> red: 14 | far red: 01</td> <td><img src='https://i.imgur.com/TWimMqB.jpeg'/></td> </tr> <tr> <td>4000K CRI 90</td> <td>68 lux = 1 uMol/m2/sec</td> <td>blue: 20 </br> green: 40 </br> red: 31 | far red: 02</td> <td><img src='https://i.imgur.com/OmQDZBU.jpeg'/></td> </tr> <tr> <td>5000K CRI 70</td> <td>75 lux = 1 uMol/m2/sec</td> <td>blue: 13 </br> green: 22 </br> red: 09 | far red: 01</td> <td><img src='https://i.imgur.com/47SoeNf.jpeg'/></td> </tr> <tr> <td>5000K CRI 80</td> <td>76 lux = 1 uMol/m2/sec</td> <td>blue: 26 </br> green: 50 </br> red: 21 | far red: 01</td> <td><img src='https://i.imgur.com/9VT7LYL.jpeg'/></td> </tr> </table>","d":"I've tested dozens of LEDs with my spectroradiometer to get these numbers to always be within 10%._ The claims are also backed by peer reviewed literature that uses 67 lux = 1 µmol/m2/sec as a generalization for all white LEDs and not taking CRI into account.","i":[]},{"t":"MacAdam Ellipses","s":"macadam-ellipses","a":"SuperAngryGuy","c":"<p>The MacAdam ellipses, or SDCM (standard deviation of color matching), are standard deviations of perceived color differences in LED binning including white LEDs. The higher the step or standard deviation, the lower the binning tolerances which lowers LED costs.</p>\n<pre> <img src='https://i.imgur.com/jWOIqzS.jpg'/> <div>MacAdam Ellipses steps illustration</div> </pre>\n<blockquote>\n<p>Methodology was created by MacAdam in 1943 for mathematically constructing ellipses about target points. The goal of the research was to determine a series of boundaries around several color targets (x, y coordinate) on the CIE chromaticity diagram, <strong>illustrating how much one can 'stray' from the target (along various color axes) before perceiving a difference from the target color</strong>. Any point on the boundary of a '1-step” ellipse, drawn around a target, represents 1 standard deviation from the target. ANSI recommends that lamp manufacturers stay within a '4-step” ellipse. This means that, given a certain target point on the CIE diagram, lamp manufacturers are given a fairly wide range of perceptible differences. Sylvania, <a href=\"https://www.usailighting.com/stuff/contentmgr/files/1/f386756b8bcf5da65a8d3c26a56b82e7/misc/macadam_faqs.pdf\">What are MacAdam Ellipses or color ovals?</a></p>\n</blockquote>\n<p>To make it simple and practical, <em>only in a 1-step MacAdam ellipse for white LEDs are any variations in the white light unperceived to most people</em>. In a 2-step MacAdam ellipse variations may just be perceivable to a trained eye, and in a 3-step MacAdam ellipse variations may be just perceivable to an untrained eye</p>\n<p><strong>With LED grow lights we don't really care about minor variations in light</strong>, and the Samsung LM301H (horticulture) series of medium power LEDs use a 5-step MacAdam ellipse binning, while the LM301B (general illumination) uses a 3-step. In other words, the LM301H has a lot more binning slop that is basically irrelevant to plant growth, but could be relevant for general illumination. The highest MacAdam step number used with LEDs is seven.</p>\n<p>In conclusion: don't worry if you can perceive slight color differences in the LEDs of LED grow lights! <strong>Your plants don't care.</strong></p>\n","d":"The MacAdam ellipses, or SDCM (standard deviation of color matching), are standard deviations of perceived color differences in LED binning including white LEDs. The higher the step or standard deviation, the lower the binning tolerances which lowers LED costs.","f":"The MacAdam ellipses or SDCM are <b>standard deviations of perceived color differences</b> in LED binning including white LEDs.","i":[]},{"t":"Main Container","s":"main-container","a":"ekrof","c":"<p>Space Buckets can be created with a <strong>wide variety of containers.</strong> The original design features 5gal buckets which are cheap (or free) and easy to find, but many other plastic containers have been tested successfully. Supersized bins and Brute buckets are a great alternative for bucketeers that want more space for their plants. Boxes and totes are another great option that allows for high wattage lighting.</p>\n<h3>Buckets</h3>\n<pre> <img src='https://spacebuckets.com/u/morrigan-disapproves/c7c3bf.jpg'/> <div>5gal are the smallest size for Space Buckets</div> </pre>\n<p><em>The best kind of buckets to build Space Buckets are of the <a href=\"https://amzn.to/33ufG6O\">5gal variety</a></em>. <strong>This size has a very small footprint and allows for one plant cultivation.</strong> When in doubt, go with 5gal containers: the community has a lot of experience using them, and they are many examples and tips for this design. The best feature of 5gal buckets is that they are easily stackable, which makes them naturally modular. A 5gal bucket with a <a href=\"https://amzn.to/3cTWBxT\">135w UFO</a> and <a href=\"https://amzn.to/2SqBauJ\">5630SMD</a> LEDs will provide solid performance for all kinds of plants.</p>\n<ul>\n<li><a href=\"/gallery/1/bucket\">View over 200 bucket build examples in the Gallery »</a></li>\n</ul>\n<h3>Brutes</h3>\n<p><em>Supersized containers have evolved alongside the classic Space Bucket design</em>. This option is perfect for gardeners that wish to grow bigger plants, or for those who feel constrained by the dimensions of the 5gal bucket. <a href=\"https://amzn.to/3cXD27R\">Brute buckets are sold by Rubbermaid</a>, and work very well for SB gardening: these containers are sturdy, stackable and easy to expand. There are 10gal, 20gal and 32gal options, which can all be used for Space Bucketing. The 10gal brutes are a safe step up from the original containers. The only real disadvantage of Brutes is their price and general availability. The <a href=\"/u/bruteled\">Simple LED Brute by /u/halfmpty</a> is a great example for this kind of style.</p>\n<ul>\n<li><a href=\"/gallery/1/brute\">View 27 brute build examples in the Gallery »</a></li>\n</ul>\n<h3>Bins</h3>\n<p><em>A cheaper alternative to Brute containers are plastic garbage bins</em>, which are easier to find and also come in a <a href=\"https://amzn.to/2GyHEoK\">wide variety of sizes</a>. These containers work well for SB gardens, but they are <strong>usually not stackable</strong>, which makes them harder to tweak. This is a good option for bucketeers that want a big garden with materials that they already have around the house. Brutes or Bins, given their supersized nature, <strong>need extra lighting power to function properly</strong>. A <a href=\"https://amzn.to/36NO5zr\">UFO LED light</a> is the minimum viable solution for supersized main lighting. LED strips are also essential for these kind of builds: multiple strips can be installed in the container to reach the lower parts of the plants.</p>\n<ul>\n<li><a href=\"/gallery/1/bin\">View 27 bin build examples in the Gallery »</a></li>\n</ul>\n<h3>Totes</h3>\n<pre> <img src='https://spacebuckets.com/u/spacetotebuilder/564b45.jpg'/> <div>Totes can be used to grow two plants at once</div> </pre>\n<p><em>A Space Bucket can also be made with <strong>plastic boxes, generally known as totes</strong></em>. These rectangular containers are even bigger than supersized Brutes, and usually come in <a href=\"https://amzn.to/33sAcEQ\">various versions</a>. They have a bigger footprint than buckets, buy <strong>they allow for more powerful designs.</strong> Tote gardens stack two containers on top of each other, with one inverted functioning as the light-top. This means that the SB tote design features a fixed height. Given their massive size, SB totes need powerful lighting from all sides, with a <a href=\"https://amzn.to/3isnVo5\">300w UFO LED panel</a> being the most recommended option.</p>\n<ul>\n<li><a href=\"/gallery/1/tote\">View 43 bin build examples in the Gallery »</a></li>\n</ul>\n","o":"1","d":"Space Buckets can be created with a wide variety of containers. The original design features 5gal buckets which are cheap, but many other options work well.","i":[]},{"t":"Space Buckets Manifesto","s":"manifesto","a":"ekrof","c":"<p>Humans of the Earth! Hear the Space Buckets calling. It is time for a DIY indoor gardening revolution. We stand at the vanguard:</p>\n<ul>\n<li><em>I. Bucket culture is open.</em> We are a community of learners, a movement of tinkerers. Our goal is to spread information about how to grow plants inside small containers with artificial lighting. Anyone can join us.</li>\n<li><em>II. Bucket knowledge is free.</em> We believe in the free flow of ideas and the unparalleled power of the Internet. We are part of the web, and we contribute to it. Profit is not our motivation, innovation is.</li>\n<li><em>III. All plants are inside our law.</em> We do not judge species based on their political situation. We are a melting pot of photosynthesis enthusiasts.</li>\n<li><em>IV. Bucketeers matter.</em> Every gardener can make an impact in his inner self and social circle. Watching a plant thrive is a perspective-gaining experience. This bucket mindset pushes us forward.</li>\n</ul>\n","o":"3","d":"Humans of the Earth! Hear the Space Buckets calling. It is time for a DIY indoor gardening revolution. We stand at the vanguard.","i":[]},{"t":"The McCree curve","s":"mccree-curve","a":"SuperAngryGuy","c":"<p><strong>The McCree curve is a quantum efficiency lighting curve used in botany</strong> and should be used only as an initial foundation for understanding photosynthesis rates by wavelength. It is far more accurate than charts for chlorophyll dissolved in a solvent or charts for green algae, and it is common for these charts to get mixed up.</p>\n<pre> <img src='https://i.imgur.com/bSdzTiu.jpg'/> <div>Assimilation chamber for measuring photosynthesis</div> </pre>\n<p>It was developed in the early 1970s by <strong>Keith McCree</strong>, a Ph.D physicist that was a professor of Soil and Crop Sciences at Texas A&amp;M University. He tested 22 different crop plant types for photosynthesis rates with a PPFD of 18-150 µmol/m2/sec, in monochromatic light at 25nm intervals from 350nm to 750nm, and using the single leaf model. <strong>The McCree curve is only valid for these conditions.</strong> Monitoring CO2 uptake was used to measure photosynthesis rates.</p>\n<blockquote>\n<p>The measurements were made to provide a basis for discussion of <strong>the definition of 'photosynthetically active radiation'</strong>. The action spectrum, absorptance and spectral quantum yield of CO2 uptake were measured, for leaves of 22 species of crop plant, over the wavelength range 350 to 750nm. The following factors were varied: species, variety, age of leaf, growth conditions (field or growth chamber), test conditions such as temperature, COs concentration, flux of monochromatic radiation, flux of supplementary white radiation, orientation of leaf (adaxial or abaxial surface exposed), For all species and conditions <strong>the quantum yield curve had 2 broad maxima, centered at 620 and 440nm, with a shoulder at 670nm</strong>. The average height of <strong>the blue peak was 70% of that of the red peak</strong>. K. J. McCree, <a href=\"http://www.esalq.usp.br/lepse/imgs/conteudo_thumb/mini/The-action-spectrum-absorptance-and-quantum-yield-of-photosynthesis-in-crop-plants.pdf\">The action spectrum, absorptance and quantum yield of photosynthesis in crop plants</a>.</p>\n</blockquote>\n<h3>Key Takeaways and limitations</h3>\n<pre> <img src='https://i.imgur.com/U5lUGp1.jpg'/> <div>Weighting factor for photosynthesis <a href='https://en.wikipedia.org/wiki/Photosynthetically_active_radiation#/media/File:Photosynthesis_yield_photon_flux_spectral_weighting.svg'>(source)</a></div> </pre>\n<ul>\n<li><em>The McCree curve illustrates that all of 400-700nm is useful for photosynthesis</em> including green light, and not just red and blue.</li>\n<li>The McCree curve should not be used for <strong>very high lighting levels</strong>. It is only valid at about 15-150 umol/m2/sec of monochromatic light.</li>\n<li>The McCree curve <strong>only looks at the single leaf model of plant growth, not the whole plant model</strong>. It also <strong>does not take in to account multi-wavelength lights</strong> including mixing in far red to try to increase photosynthesis efficiency (see the <a href=\"/docs/emerson-enhancement-effect\">Emerson enhancement effect</a> for more).</li>\n<li>McCree also <strong>tested the underside (abaxial) of leaves, and found that they were also performing photosynthesis</strong>. In many cases the underside of a leaf will have a lower chlorophyll density, and may reflect more green light than the topside (adaxial) of a leaf, which may lower green light photosynthesis. The work of McCree demonstrated that <em>both sides of a leaf can be used efficiently for photosynthesis</em>. Dicotyledons may reflect more green light on the abaxial (underside) of a leaf, while monocotyledons will have the same green reflectance on both sides of a leaf.</li>\n<li><strong>YPF (YPFD) or 'yield photon flux (density)'</strong> is PPFD that has been weighed to the McCree curve. It is fortunately rarely used in botany but you do sometimes see it. There are special PAR sensors that give measurements in YPFD instead of PPFD, as well as spectroradiometers that can do this.</li>\n</ul>\n","d":"The McCree curve is a quantum efficiency lighting curve used in botany for understanding photosynthesis rates by wavelength. It is far more accurate than charts for chlorophyll dissolved in a solvent or charts for green algae.","f":"The McCree curve illustrates that <b>all of 400-700nm wavelength is useful for photosynthesis</b> including green light, and not just red and blue.","i":[]},{"t":"Mixing Light Colors","s":"mixing-colors","a":"SuperAngryGuy","c":"<p>I go with <em>3000K or 3500K for all around use for plant growing</em>, but experiment with various 1750K to 6500K COBs as well (1750K is about what candle light is). In my opinion, mixing warm white and cool white LEDs in a grow light makes no sense, and I consider it a marketing gimmick at best. <strong>An exception is if you want a variable color temperature grow light</strong>, then it makes sense to to mix warm white and cool white dimmable separately, or use dimmable warm white and blue LEDs to control the color temperature.</p>\n<p>I consider <strong>mixing red LEDs (like 630nm and 660nm, or 450nm and 470nm)</strong> to also be a marketing gimmick, unless a clear demonstration as to their combined efficacy can be demonstrated in controlled grows (temperature, humidity, CO2, and lighting levels consistent and does not significantly fluctuate to remove as many variables as possible). My first non-controlled experiments were in 2008 where <strong>I found no significant difference in 450-660, 450-630, 450-630-660nm, and white light for a leafy lettuce cultivar</strong>. I soldered up a few thousand low power 5mm LEDs to do these early experiments.</p>\n<pre> <img src='https://i.imgur.com/0gyuyGX.jpg'/> <div>Planckian locus in the CIE 1960 color space (<a href='https://en.wikipedia.org/wiki/File:Planckian-locus.png'>source</a>)</div> </pre>\n<p><em>There is nothing special about 6500K light</em> for plants that may be used in vegging and don't normally use it. Higher color temperature light usually have a higher luminous efficacy, and 6500K is about the highest color temperature that is tolerated for the consumer before appearing too blue. It's more often found in work spaces. 6500K is also the color temperature of the standard illuminate D65 used in photometry. 6500K has very little to do with professional grow lighting, and traditional (non-ceramic) metal halide is 4200K.</p>\n<p><em>There is nothing special about 2700K light</em> for plants that may be used for flowering. It's about what incandescent bulbs roughly are and is close to the color temperature for the illuminate standard A used in photometry. You typically want to use this color temperature range or a bit higher for living spaces. 2700K has about 10% blue light, 4200K has about 20% blue light, 6500K has about 30% blue light. The greater the blue light content, <a href=\"/docs/light-colors\">the more compact the plant will be</a> by reducing acid growth due to lower auxin levels.</p>\n<p>Although we tend to use higher color temperature white light for vegging and a lower color temperature for flowering, I've gotten great veg growth with 2100K HPS for cannabis when LST (low stress training) techniques and higher lighting levels were used (500 umol/m2/sec). <strong>I've found greater growth at higher lighting levels but at lower color temperatures with various microgreens testing 2000K, 3000K, and 5000K light</strong>. If longer stems is what want (and what you get with lower lighting levels), but still want aggressive growth with larger leaves, play around with 2000K white LEDs at higher lighting levels for microgreens.</p>\n","o":"3","d":"I go with 3000K or 3500K light color for all around use for plant growing, but experiment with various 1750K to 6500K COBs as well. In my opinion, mixing warm white and cool white LEDs in a grow light makes no sense.","i":[]},{"t":"Pest Control","s":"pest-control","a":"ekrof","c":"<p>Pests are one of the biggest challenges that a gardener has to face, and this is also true in small enclosed containers like Space Buckets. <strong>A pest invasion can ruin a garden at any point, so it is important to know how to keep them at bay.</strong> The techniques used for pest control in bigger gardens can be used for Space Buckets too. As a general rule, it is always better to use organic pesticides that are safe for human consumption, especially when growing plants like cannabis, hot peppers or cherry tomatoes. Do not use chemical pesticides if you plan to eat the fruits of your labor.</p>\n<h3>Neem Oil</h3>\n<p>Neem Oil is a safe and always recommended alternative pesticide. This is a vegetable oil that is pressed from the fruits and seeds of the neem plant. This oil, when sprayed on a plant, <strong>acts as a natural pesticide that repels a wide variety of insects, including spidermites and aphids, two of the most common pests. It also repels caterpillars, locusts, fungus gnats, ants, thrips, leafminers and more</strong>. Other than insects, Neem controls powdery mildew, black spot and rust fungi, all while being completely safe to mammals, birds and beneficial insects (like ladybugs). To apply Neem Oil it is best to spray the plant as with any other pesticide. Use the Neem oil to cover the entire plant, especially on the underside of the leaves, where lots of bugs hide. Repeat the process every 3-4 days fro two weeks and the plant should be pest free. You can also spray the soil, as the plant will absorb and distribute it along its tissue. <strong>Once the neem compound is present in the plant vascular system, the pests intake it during their feeding</strong>, and that is the end of them.</p>\n<h3>Diatomaceous Earth</h3>\n<p>Diatomaceous Earth is another great and natural tool to fight off pests, and it works great in combination with Neem Oil. <strong>DE is a soft, sedimentary rock that can be turned into a fine powder. It consists of fossilized remains of diatoms</strong>, a type of hard-shelled organisms. Among other things, it is used as a mechanical pesticide, and can be specially useful for controlling pests in small spaces. The fine powder of Diatomaceous Earth absorbs lipids from the insect's exoskeletons, causing them to dehydrate and die. This also works for other pests, like gastropods and slugs. Also pH is DE neutral, and because it is a mineral source of pH, <strong>it tends to stabilize pH in soil and hydroponics</strong>.</p>\n<h3>Top Soil Layer</h3>\n<p>One of the easiest and most effective pest control techniques is to <strong>put a layer of material on top of the soil of the plang: Diatomaceous Earth, perlite or aquarium gravel all work well for this application.</strong> Once the top part of the soil is covered, the pests ability to reproduce will be greatly reduced, interrupting their remaining life-cycle. Perlite is usually the best choice for this application, as Diatomaceous Earth can get muddy after a few waterings.</p>\n","o":"11","d":"Pests are one of the biggest challenges that a gardener has to face, and this is also true in DIY setups like Space Buckets. A pest invasion can ruin a garden at any point, so it is important to know how to keep them at bay.","i":[]},{"t":"Photomorphogenesis: How Light Colors Affect Plants Growth","s":"photomorphogenesis","a":"SuperAngryGuy","c":"<p>Photomorphogenesis has to do with <strong>light sensitive proteins</strong>, and unlike photosynthesis, can be very wavelength dependent in a plant's response. The <a href=\"https://en.wikipedia.org/wiki/Phytochrome\">phytochromes</a> are predominately red and far red with Pr peaking around 660nm. The <strong>blue sensitive proteins</strong> are the <a href=\"https://en.wikipedia.org/wiki/Cryptochrome\">crytochromes</a> and <a href=\"https://en.wikipedia.org/wiki/Phototropin\">phototropins</a> have what's known as the 'three finger blue action response' with peaks at roughly 430nm, 450nm, and 470nm depending on the specific protein.</p>\n<pre> <img src='https://i.imgur.com/3eqaUCv.jpg'/> <div>Blue light sensitive protein <a href='https://www.researchgate.net/figure/The-green-gap-Maximum-external-quantum-efficiency-EQE-of-different-commercial-nitride_fig3_283335209'>(source)</a></div> </pre>\n<h3>BLUE</h3>\n<p><em>Blue light decreases <a href=\"https://en.wikipedia.org/wiki/Acid_growth\">acid growth</a></em> (which is different than growth through photosynthesis). Excess acid growth, or 'stretching', in seedlings/veg is all about greater cell expansion in the stem that we get from <strong>lower lighting levels or not enough blue light</strong>. We typically only want as much blue in a light source to help prevent any excess stem elongation. Blue photons have much more energy needed for photosynthesis, and <strong>this extra energy is wasted as heat that the plant has to dissipate</strong>. The associated blue light sensitive proteins are the <a href=\"https://en.wikipedia.org/wiki/Phototropin\">phototropins</a> and <a href=\"https://en.wikipedia.org/wiki/Cryptochrome\">cryptochromes</a>.</p>\n<h3>GREEN</h3>\n<p>In healthy cannabis, <em>80-90% of green light is being absorbed and available for photosynthesis</em>. Green is the opposite of blue in photomorphogenesis responses in that green causes stretching also called the <a href=\"https://en.wikipedia.org/wiki/Shade_avoidance\">shade avoidance responses</a>. <strong>Pretty much anything blue does, green does the opposite</strong>.</p>\n<p>Green can help make leaves larger due to the reversibility of blue light sensitive proteins and this in turn increases the LAI (leaf area index) for greater light capture. Green light can also cause the <strong>stomata (gaseous exchange pores) of plants to close</strong> a bit more than normal, which is the opposite of blue light.</p>\n<pre> <img src='https://i.imgur.com/muECkJI.jpg'/> <div>The green gap problem for LEDs <a href='https://www.researchgate.net/figure/The-green-gap-Maximum-external-quantum-efficiency-EQE-of-different-commercial-nitride_fig3_283335209'>(source)</a></div> </pre>\n<p><strong>Green LEDs are relatively electrically inefficient</strong> which is why they are not commonly used in grow lights. In physics/engineering this is known as the green gap (graph). We do, however, perceive green light much higher than red or blue light, so for display purposes this inefficiency matters less.</p>\n<ul>\n<li><a href=\"/docs/green-leaves-green-light\">Learn more about Green Leaves and Green Light »</a></li>\n</ul>\n<h3>RED &amp; FAR RED</h3>\n<p>For photomorphogenesis responses, red and far red are opposites like blue and green are opposites. <em>Red can help keep a plant more compact</em> but not nearly to the degree of blue. The associated red/far red light sensitive proteins are the <a href=\"https://en.wikipedia.org/wiki/Phytochrome\">phytochromes</a>. Red photons have a lower energy with a higher theoretical PPE of about 5.51 uMol/joule (660nm) compared to blue of 3.76 uMol/joule (450nm). The higher efficacy is <strong>one reason why red LEDs are being added to white LEDs</strong>: what's held them back is their electrical efficiency (red and blue LEDs use different semiconductor material).</p>\n<p><em>Far red causes greater stretching</em> like green light and contributes to the shade avoidance responses. It 'may' help put short day plants 'to sleep' faster. Far red may in some plants <strong>may be able to drive photosynthesis efficiently</strong> though the Emerson enhancement effect. About 50% of far red light is reflected off plant leaves, and also transmits easily though leaves.</p>\n<ul>\n<li><a href=\"/docs/emerson-enhancement-effect\">Learn more about the Emerson Enhancement Effect »</a></li>\n</ul>\n<h3>UV</h3>\n<p><em>Ultraviolet is a wild card</em> and I can make no rhyme or reason of it working with a variety of plants. <strong>It tends to cause dwarfing</strong> when used as an only light source (UVA). For cannabis, the idea is to try to increase trichome and THC levels by adding UV, but some researchers including <a href=\"https://www.reddit.com/r/IAmA/comments/paoigz/im_dr_bruce_bugbee_professor_of_crop_physiology/ha6jc88/?context=3\">Bruce Bugbee are saying this does not happen</a>. The only identified UV protein is the <a href=\"https://en.wikipedia.org/wiki/UVR8\">UVR8 protein</a>, <strong>which is only UVB sensitive, not UVA sensitive</strong> (285nm peak sensitivity).</p>\n<ul>\n<li><a href=\"/docs/lux-ppfd-conversion\">Learn more about Ultraviolet growing »</a></li>\n</ul>\n","o":"3","d":"Blue light decreases acid growth (which is different than growth through photosynthesis). Excess acid growth, or 'stretching', in seedlings/veg is all about greater cell expansion in the stem that we get from lower lighting levels or not enough blue light. We typically only want as much blue in a light source to help prevent any excess stem elongation.","f":"Generally speaking, in healthy plants up to <b>80-90% of green light is being absorbed</b> and is available for the photosynthesis process.","i":[]},{"t":"Photosynthesis","s":"photosynthesis","a":"SuperAngryGuy","c":"<p>The light that we're interested in for photosynthesis is about <strong>400nm (UV-A) to 700nm (deep red) and is known as Photosynthetically Active Radiation (PAR)</strong>. It actually extends a little lower than 400nm but it's very inefficient.</p>\n<pre> <img src='https://i.imgur.com/jLQvCtf.png'/> <div>Phloem transports the products of photosynthesis <a href='https://en.wikipedia.org/wiki/Phloem'>(source)</a></div> </pre>\n<p>The whole concept of photosynthesis is <em>a plant takes in water, carbon dioxide and light to make sugar and oxygen</em>. It's all about making sugar which is <strong>transported through the plant via the <a href=\"https://en.wikipedia.org/wiki/Phloem\">phloem network</a></strong>.\nThis is expressed in the simplified equation of <strong>6CO2</strong> (six carbon dioxide molecules from the air) + <strong>6H2O</strong> (six water molecules from the roots) powered by light = <strong>C6H12O6</strong> (one sugar molecule that the plant uses for energy) + <strong>6O2</strong> (six oxygen molecules given off as a gas).</p>\n<p><strong>The uptake of water and nutrients is via the <a href=\"https://en.wikipedia.org/wiki/Xylem\">xylem network</a> from the roots</strong>, and that doesn't mean adding sugar to your soil is absorbed by the plant. Also, <em>no fresh air means a low photosynthesis rate</em> in a small volume since the carbon dioxide in the air is rapidly consumed unless CO2 enhancement is used. For that purpose you could use solutions such as a tank/regulator, or just being in the same room with the plants. As a reference, a typical exhaled breath is 4500-5000 ppm CO2.</p>\n<h3>The dreaded charts</h3>\n<p><strong>There's four charts that people often get confused</strong>: chlorophyll and other pigments dissolved in a solvent, leaf absorption, action spectra and relative quantum yield. If you're going off a chart that has sharp peaks and talk about very specific wavelengths needed for photosynthesis optimization, <strong>then you're probably using the wrong chart</strong> (pigments dissolved in a solvent). If you're using a chart with a really deep dip in the green/yellow/orange area then it's likely for algae or aquatic plants.</p>\n<p><em>The relative quantum yield chart is what we want to use</em> since it is a measure of how much sugar is produced. This is the correct chart for land plants and are the average of dozens of plants. Keep in mind that <strong>this is only for monochromatic light</strong> which below you'll see why may be problematic. These are relative charts and not absolute charts.</p>\n<pre> <img src='https://i.imgur.com/eiiwTmj.png'/> <div>For leaves grown in the field and in a growth chamber, normalized leaf yield relative to quantum of energy absorbed <a href='http://www.ecosearch.info/sites/default/files/prodotti_documentazione/TechNote126_quanti.pdf'>(original source)</a></div> </pre>\n<p>Although <strong>red light is generally most efficient in photosynthesis</strong>, <a href=\"/docs/green-leaves-green-light\">green light is also actively used in photosynthesis</a>. In fact, with a bright white light source it can be the case that adding more green rather than red or blue is how to increase photosynthesis efficiency. This is because <strong>green can reach in to deeper <a href=\"http://en.wikipedia.org/wiki/Chloroplast\">chloroplasts</a> in the leaves</strong>.</p>\n<h3>Be careful of improper use of pigment charts</h3>\n<p>LED grow light manufacturers tend to use the solvent absorption charts which are wildly off in the green/yellow/orange area <strong>to boost their claims of very high yields per watt</strong>. It's all BS marketing. Look at the spectrum of HPS vs quantum yield charts and you'll see that it has a very high efficiency and not the 10% ballpark efficiency that is often claimed. For example, a 600 and 1000 watt HPS puts out around 215 and 358 PAR watts perspectively (this is 35.8% PAR efficient).</p>\n<p>LED grow light manufacturers also often use the incorrect chlorophyll dissolved in a solvent or algae charts <strong>to back their claims that specific wavelengths are needed for photosynthesis</strong>.</p>\n<p><em>The correct chart to use is <a href=\"/docs/mccree-curve\">the McCree curve</a></em> based on an average of 22 different plants which shows 550nm green is more efficient than 450nm blue (blue gets absorbed by some other pigments in addition to chlorophyll) and is the chart used in plant photobiology. The McCree curve is <strong>only valid at about 15-150 umol/m2/sec of monochromatic light</strong> and is most certainly not the be-all and end all-in in lighting spectrum charts. But, it's a good starting point and much more honest.</p>\n<p>If you find a chart with a deep dip in the green area <strong>then it's for some sort of algae or bacteria, not green terrestrial plants</strong>. If you find a chart with a bunch of chlorophyll and other pigment peaks then it's only valid as an extract in vitro (in the test tube or cuvette) and not in vivo (the living leaf itself). <strong>The pigment peaks can differ depending on the solvent used</strong> and the charts do not tell how much there is of a particular pigment so take them with a grain of salt. They are only valid for the particular set up used.</p>\n","i":[]},{"t":"Plant Species","s":"plant-species","a":"ekrof","c":"<p>Space Buckets can be used to grow nearly all species of plants, <strong>specially those that are naturally short or react well to training.</strong> For this reason, plants like cannabis, hot peppers, cherry tomatoes, and leafy herbs are all very recommended. Even if the plant is a tree, a SB can function as a highly effective growth chamber: tree saplings can be started indoors to strenghten them before planting in an outside location. <strong>Bucket gardens also have great performance for all kinds of cuttings and clones, and can be used to sustain plants during the winter time.</strong></p>\n<pre> <img src='https://spacebuckets.com/u/cherry-tomato-journal/3f341a.jpg'/> <div>Cherry tomatoes love to grow in Space Buckets</div> </pre>\n<h3>Cannabis</h3>\n<p>This species is the most popular among bucket gardeners for a variety of reasons. <strong>Cannabis plants require optimum lighting and enviromental conditions</strong>, which can be easily controlled inside a small enclosed container. Bucket cannabis plants are typically vegged for about a month while training agressively, and then flowered according to the strain. The most difficult part of growing this plant inside a bucket is controlling the flowering stretch, which can multiply the height three fold. Techniques like topping and LST are absolutely essential for cannabis in SB.</p>\n<h3>Cherry Tomatoes</h3>\n<p>This is one of the most rewarding plants that can be grown in a Space Bucket. <strong>Cherry tomatoes are relatively easy to grow, and can produce many fruits in a short period of time</strong>. There are many varieties available and all work well with SB, given their naturally short stature. Cherry tomatoes can be pruned, topped and trained, which will be essential for a good bucket performance. As with hot peppers, it is recommended to pollinate cherry tomatoes manually, gently shaking the branches or using an electrical toothbrush to distribute the pollen.</p>\n<h3>Hot Peppers</h3>\n<pre> <img src='https://spacebuckets.com/u/bucket-potatoes/9a8a6f.jpg'/> <div>How about some bucket potatoes?</div> </pre>\n<p>SB can be used to grow every species of hot peppers, and a lot of bucketeers choose this plant. <strong>Variants like habanero and jalapeño are especially popular among bucket gardeners</strong>. These plants don't need a very aggressive training, though they benefit from LST and HST techniques. Some topping is usually required, and manual pollination is recommended to increase the pepper yields. The lighting schedule depends on the specific strain, but 12/12 is a safe bet. Reddit communities like /r/HotPeppers are a good resource for these kinds of plants.</p>\n<h3>Herbs and Greens</h3>\n<p>Space Buckets can also be used to grow all kinds of herbs: these plants have great performance and are much easier to maintain, as they general don't require any training. Harvest is much more regular, because the important parts are the leaves and not the fruits or flowers, which are harder to produce. <strong>Some examples of great bucket herbs are basil, chives, dill, rosemary, oregano, mint and more.</strong></p>\n<h3>Other Plants</h3>\n<p>Over the years, bucketeers have experimented with many plant species, like strawberry, potatoes, wasabi and even an avocado sapling. Expanding the bucket plant portfolio is a good cause!</p>\n","o":"12","d":"DIY indoor gardens can be used to grow all species of plants, specially those that are naturally short or react well to training. Plants like cannabis, hot peppers, cherry tomatoes, and leafy herbs are all very recommended!","i":[]},{"t":"Plant Training","s":"plant-training","a":"ekrof","c":"<p>Space Buckets can be used to grow many kinds of plants, but they need to be trained to fit the limits of its container. Even with supersized gardens, plant training is a must, an essential tool for bucketing. Untrained plants can outgrow their buckets easily, which means a poor performance.\nPlant training techniques can be divided into two main e: <b>Low Stress Training, which includes bending, tucking and guiding the stems; and High Stress Training, which purposely stresses the plant to make it heal ber.</b> Because of its low stress implications, LST can be started early in the life of a plant, and it is specially useful for cannabis and hot peppers. As the plant gets older, it stem hardens, which makes the training more difficult. HST techniques can be more effective, but also pose a higher risk of failure. These methods have a drastic impact on the plant, and require a few days of healing time. They are also very recommended for bucket gardening, and sometimes inevitable.</p>\n<h3>LST</h3> The most basic form of training implies <b>bending the stems of the plant to make it grow in a horizontal fashion.</b> This can be achieved with hooks that wrap around the stems and into the soil. With this method, the plant grows into a bush form, creating a more even canopy, something that is very important for gardening in small spaces. It can be hard to predict the growth pattern of a plant, so every new hook needs to be strategically planted along the way.\n<h3>Tucking</h3> Tucking leaves is another useful LST technique, and a good alternative to pruning. In this case, <b>the idea is to pull leaves that are blocking important parts of the plant, like flowering tops.</b> Instead of removing the leaf, it can be tucked behind a stem, exposing a part that needs to be emphasized. This is usually better than pruning, as it does not require healing time and allows the plant to use the nutrients stored in the leaf. In situations where tucking is impossible, a bit of prunning can be useful, but only removing a few leaves at a time.\n<h3>Topping</h3> Topping is the main HST technique in a bucketeers arsenal. <b>This method requires removing the topmost growth of the plant, which forces it to grow in a bushier kind of tree</b>. When applied early, topping alters the canopy significantly, and limits the height of the plant. This training technique can be used multiple times, and every time it will multiply the number of branches. Because it removes unwanted parts of the plant, topping results in a cleaner, more predictable training. Even though topping is a powerful tool for plant training, it is a High Stress technique: topped plants need a few days of healing to recover. During that time, further training is not recommended. Keep in mind that not all plants react positively to topping, so research species characteristics before using this or other HST techniques.\n<h3>Supercropping</h3> Supercropping is another useful tool for controlling the plants growth and training its canopy: in its simplest form, <b>it means pinching the stem to force the plant to heal its internal structure. Once healed, this results in ber and faster growth.</b> The most important part of supercropping is to avoild breaking open the stem, and just crushing it. A whole branch of the plant can die if the Supercropping is excessive. Supercropping tends to be considered a controversial technique, given its high stress methods. As with topping, not all plants react positively to this kind of training. Supercropping is recommended for gardeners that already have some experience in plant growing.","o":"13","d":"Learn the secrets of plant training in small spaces. DIY indoor gardening can be used to grow many kinds of plants, but they need to be trained with LST, topping, tucking or supercropping.","i":[]},{"t":"Safety Guidelines","s":"safety-guidelines","a":"SuperAngryGuy","c":"<p>As a (former) electrician for 10 years who went through a 5 year union apprenticeship program and a hardcore electronics geek, <strong>I want to give a few safety tips</strong> because I've seen some stuff that's got my spider-sense tingling. <em>Everything is done at your own risk and liability. I just want to minimize that risk</em>.</p>\n<h3>Use a GFCI!</h3>\n<pre> <img src='https://i.imgur.com/QqDfGit.jpg'/> <div>GFCI protects you from ground path faults</div> </pre>\n<p>That's <em>Ground Fault Circuit Interrupter</em>. You have electricity and a lot of moisture: that could be a bad combination. <strong>GFCI protects you from ground path faults.</strong> In other words, it prevents serious shocks from the wall power supply, through your body and to ground. Literally, this means a ground path to earth itself or a ground path to an object at ground potential. Twice I've had GFCI protect me from being severely shocked. You'll still feel a slight tingle but that's it. No dying, though. How cool is that!\nGFCI does not protect you from hot and neutral wire shocks because it only <strong>shuts the circuit off if there's a current imbalance between the hot and neutral wire.</strong> If there is, it means current is going to ground when it's not supposed to. That's bad- it could be going through your flailing and thrashing body. A GFCI circuit does not require a ground wire to work. GFCI can be found in breakers, receptacles, power strips or adapters. How much is your life worth?</p>\n<p><em>Wet concrete floors are bad!</em> Get them off the floor and get yourself off the floor. It's just another safety thing to keep in mind. Wet concrete has a bad habit of conducting electricity. <strong>Play it safe and think of wet concrete as standing in a mud puddle from an electrical safety stand point.</strong> This is why it's a good idea to have GFCI protection in garages.</p>\n<h3>Sockets need to be wired the right way</h3>\n<p><em>I don't care if it is just two wires. One is the hot (black) and one is the neutral (white)</em>. If you have a brown and blue wire, it's almost always the case that the brown is the hot and the blue is the neutral. You'll see this in some appliances and extension cords depending where you live in the world. If the socket has pig tails (it's own wire sticking out), it's always hot wire to socket black wire and the neutral wire to the socket white wire. <strong>NO EXCEPTIONS!</strong> If there's screws instead of wires, the brass/gold colored one is for the hot wire and the silver colored one for the neutral wire (more below on this). Why is this so important? Because when you screw in a bulb there might be a little metal exposed at the bulb's base.</p>\n<p>Wired backwards and you have an energized metal part exposed (bad). Wired correctly and you have a exposed metal part at ground potential (better). <strong>Wrap any exposed with a little tape and you have very good.</strong> If you have a lighting socket with 2 of the same colors coming out, the neutral will be connected to the socket side threads, the hot connected to the metal piece deep in the center of the socket. In this case you need a continuity tester or multimeter to determine which wire is the neutral.</p>\n<h3>Splice wires correctly!</h3>\n<pre> <img src='https://i.imgur.com/EleaEp8.jpg'/> <div>Wire nuts are easy and safe to use</div> </pre>\n<p>With Space Buckets you're going to run in to situations where a junction box may not be able to be used so here's some open air splicing tips. <strong>If you can pull the wires apart then you have a bad splice</strong>. <em>The preferred way is using wire nuts</em>. Strip your wires 5/8ths of an inch, put them in the opening and twist until you can't anymore. There's a spring inside that tightens the wires together. It's not necessary to twist the wires first. You should, however, tug on each wire to make sure it's well connected after the wire nut is twisted on. Tape the wire nuts up. You should so no exposed metal parts from any angle.</p>\n<p><strong>The second way is a butt splice</strong>. They’re sometimes called <strong>splice crimps</strong>. Strip wires, stick them in and use pliers to crimp the aluminum tube inside as hard as possible. There are special pliers for this but any pliers can do. Again, tug on the wires to make sure they're secure and tape as needed.</p>\n<p><em>The third way is tape and solder</em>. Twist the wires in a rat-tail splice, solder them up and use a higher quality electrical tape preferable <strong>Scotch Super 33+</strong> to wrap them up. 33+ has an adhesive that hold under a wide range of temperature and humidity. Low quality electrical tape has a bad habit of becoming undone at higher temperatures and humidity. <em>Twist and tape alone is not recommend for line voltage splicing</em>. The same with a T-splice unless tape and solder is also used.</p>\n<h3>Secure those wires!</h3>\n<p>This means <strong>additional stain relief and to preferably use tie wraps</strong> to secure the wire to the bucket's lid. Drill 2 small holes just big enough for the tie wrap and secure the wire to the lid that way. Sticky backs can also be used. Use some 5 minute epoxy if needed to secure the sticky back. Even it everything feels snug, it may actually be 1 or 2 out of 3 that are snug. Loose connections means fire. <strong>Push the male prongs together to the point that you have to do a little wiggling to plug something in.</strong> This is really more critical wire higher current loads like electric space heaters, HPS lighting and the like but a good habit to get in to.</p>\n<p><em>Never use line voltage at canopy level!</em> If you use LED intracanopy lighting, <strong>use a lower voltage to drive them.</strong></p>\n<h3>If using foil as a reflector, ground it</h3>\n<p>With three conducts you'll typically have a black, white and green (or brown, blue, green or green with a yellow stripe depending where you live). <strong>That green wire is your grounding wire.</strong> Metal parts should be bonded to this green wire.</p>\n<p>You can use a screw/nut/washer through the bucket side, through the foil and put the green wire under the washer preferably with a fork terminal stake on. If you're connecting wires to a light socket with the gold/silver screws mention above, this is the preferable way to connect the wires. Put tape over the screws with some 5 minute epoxy to make sure the tape stays in place. <strong>The best inside the bucket reflector is flat white paint with barium sulfate added</strong>. It'll be in the high 90% range.</p>\n","o":"5","d":"Follow these safety guidelines to make your that your DIY indoor garden is following the best electrical practices.","i":[]},{"t":"Smell Control","s":"smell-control","a":"ekrof","c":"<p>Controlling odors and smells from smelly plants is a very popular topic among indoor gardeners, and Space Buckets are not the exception. Even though there are many options for reducing/removing the odors some plants exhibit, <strong>it is difficult to assure 100% 'odor proofness.' For this reason, the bucket community never recommends growing in high risk situations.</strong> It's advised against growing offensive plants, especially when others inside the home may have an issue with it, and one should also be at least acquainted with the laws and penalties of the jurisdiction in which they reside.</p>\n<h3>Inline filtering</h3>\n<pre> <img src='https://spacebuckets.com/u/titobin/3e3220.jpg'/> <div>Inline fans with filters are the best way to keep odors at bay</div> </pre>\n<p>The most effective solution for controlling plant odors in Space Bucket gardens are <em>inline fans with a specially designed filter</em>. These are the same filters that tent growers use, and because of that they tend to be bulky, expensive, quite loud and is another piece of equipment using electricity. The upside is that inline fans are exceptionally powerful, and thus can filter the air extracted from one or many interconnected buckets.</p>\n<p>A <a href='https://amzn.to/3n4LPM9'>4 inch inline fan</a> with a capacity of <strong>300m3/h should be more than enough</strong> for any Space Bucket. These inline fans are a centrifugal type fan, and are very effective by design at creating pressure, which is what is needed to push air through a carbon filter. For this reason cheaper DIY solutions using PC fans are pretty difficult to make effective.</p>\n<ul>\n<li><a href=\"/gallery/1/inlinefan\">View inline filtered build examples in the Gallery »</a></li>\n</ul>\n<h3>Homemade filters</h3>\n<p>Bucketeers can choose to build their own filters, which is usually <strong>not very effective for odors</strong>. There are many versions of DIY filters floating around the Internet, but none has proven to be really useful. The general idea is to stack two pencil cup holders with activated carbon in between. The problem is that PC fans are not powerful enough to make a difference, and even line-voltage fans will struggle to move the air through the carbon. A very powerful fan may be sufficient, <strong>but at that point an inline fan would be a smarter choice</strong>.</p>\n<h3>ONA gel</h3>\n<p>One supplemental option for activated carbon filters is <em><a href='https://amzn.to/3yKqDgU'>ONA gel</a>, a material that masks the smell in the room that is present</em>. This won't remove the odor from the ambient, but it will change its appearance. For this reason, a combination of ONA gel and inline fan + filter is the safest bet for smell concerned bucketeers. The apple crumble version of ONA gel is usually the most effective and recommended.</p>\n","o":"8","d":"Controlling odors from smelly plants is a very popular topic among indoor gardeners, and Space Buckets are not the exception. ","i":[]},{"t":"Growing plants with UV light","s":"ultraviolet-growing","a":"SuperAngryGuy","c":"<p>Adding UV LEDs (with about 100 to 400nm wavelength) are typically only used for light sensitive protein reactions effects, <strong>not as photosynthesis drivers per se</strong>. The pure UV-A grows I've done did result in slow grow and stunted plants. If I wanted to keep a tiny, important plant alive for a long duration I would be using pure UV-A. But, <em>the effects of UV-A on a plant can be unpredictable</em> and needs to be tested by cultivar. The main UV light sensitive protein known about currently is the UVR8 protein which is a 280-315nm UV-B receptor, not a UV-A receptor.</p>\n<pre> <img src='https://i.imgur.com/gMLy1OJ.jpg'/> <div>The Electromagnetic Spectrum <a href='https://en.wikipedia.org/wiki/Electromagnetic_radiation#/media/File:EM_spectrumrevised.png'>(source)</a></div> </pre>\n<p>The theoretical maximum PPE of a 375nm UV-A LED is 3.13 umol/joule, and the relative low photosynthesis rate is going to make them a no-go in LED lighting except for photomorphogenesis effects. Making red lettuce cultivars more red by increasing anthocyanin production, or trying to increase trichome and cannabinoid production in cannabis plants, may be reasons to use UV light.</p>\n<p>Anecdotally, certain selective photomorphogenesis experiments I've done with UVA compared to blue leads me to believe that <strong>there may be at least one unknown UVA light sensitive protein either as a primary receptor</strong>, or my SWAG (scientific wild-ass guess) is a UVA light sensitive protein that can express itself differently in different plant parts, affecting the protein phototropin/cryptochrome signal transduction pathways locally. For example the hypocotyl (the stem before the first set of true leaves) can react much differently than the epicotyl (the stem after the first set of true leaves) in some plants like pole beans in my 470nm vs 405nm experiments.</p>\n<h3>Safety Considerations</h3>\n<ul>\n<li><em>UV-A light (315–400nm) is fairly safe</em> (it can be dangerous when you stick your eye close to a light source that appears dim yet has a high radiant flux) and at the time of this writing, only UV-A LEDs are used in LED grow lights if UV light is used.</li>\n<li><strong>The UV-B (280–315nm) light sources</strong> I've seen in grow lights are still tube based because UV-B LEDs are still inefficient (5-10% range).</li>\n<li><em>UV-C (100–280nm) should be considered dangerous</em>, and in testing I have damaged a number of plants with higher amounts of UV-C.</li>\n</ul>\n","o":"3","d":"Adding UV LEDs (with about 100 to 400nm wavelength) are typically only used for light sensitive protein reactions effects, not as photosynthesis drivers per se. The pure UV-A grows I've done did result in slow grow and stunted plants.","i":[]}]