[{"t":"Airflow Solutions","s":"airflow-solutions","c":"Proper air circulation is essential for Space Buckets (and every other kind of indoor garden). <strong>Your bucket needs good ventilation to extract the heat</strong> from the <a href='https://amzn.to/3jMfTYw'>CFL bulbs</a> (or LED lights), and also to give the plant breaths of fresh air and plenty of CO2. In this section we review good ventilation solutions that you can use for cooling your always trusty bucket garden.\n<h3>110/220v fans</h3> These fans are a step up from standard PC fans, as they run at line voltage (110v or 220v, depending on where you live). <strong>This cooling solution is sturdy and reliable</strong>, protected with a metal frame. Most of these fans also come wired with a plug for easy installation in the garden. A typical 110v fan works at about 50CFM, with a noise level of 40dBA. <strong>These units have 40% more airflow than PC fans</strong>, which makes them a good choice for cooling small spaces (and also for DIY carbon filters such as this one).\n<h3>12v PC fans</h3> This is a basic and cheap solution for ventilation and cooling in Space Buckets. <strong>PC fans are easy to find and recycle, and they provide enough airflow</strong> to extract the heat from your garden. Keep in mind that in order to run PC fans you need a 12v power supply, which are also cheap and readily available. With 1A you can run 2 fans safely, though your mileage may vary and testing is always recommended. A typical 12v PC fan works at about 30 CFM (Cubic Feet per Minute) with a noise level of 26 dBA. These are usually not strong enough to handle carbon filters.\n<h3>Booster fans</h3> Duct fans are a great (and often overlooked) alternative for cooling Space Buckets, as they provide good airflow: the 4' version provides about 100 CFM, which is 70% more than standard PC fans. <strong>These Booster fans can be used in high temperature situations</strong> to extract the heat from the bulbs. These fans also work at line voltage (110v or 220v), and they come already wired with a plug, so installation is a matter of fitting it in the bucket and turning it on. They're a cheaper kind of inline fan, which can be used for odor carbon filtering.\n<h3>USB fans</h3> Most cheap USB fans are built with brushed rather than brushless motors and are not likely to last more than a few months (see this comparison thread). However there are some higher end USB fans (for example the Stylepie Fun Fun Fan) that are brushless and will last a long time. A sewn carbon filter can be put on this fan but its ability to push enough air through is debatable.","o":"3","d":"Proper airflow is essential for Space Buckets and indoor gardening. You need good ventilation to extract the heat away from your plants.","i":[]},{"t":"Coco Coir","s":"coco-coir","c":"Coco coir is essentially made from coconut husks. It's a fibrous material that has excellent drainage, <strong>a soilless medium that has grown in popularity in the last years</strong>. In this guide I will walk you through my coco plant growing process.\n<h3>General Usage</h3>  I use 5 parts coco coir and 1 part off-the-shelf perlite. I mix these thoroughly, until the mixture is as homogenous as possible. I next fill my pot(s) with the coco mix. Before thinking of planting, <strong>I flush the coco thoroughly with water at a pH of around 6.0</strong>. Coco works similarly to hydroponics. The coco itself has no nutrients, so it relies solely on what you put in. This a huge pro and also a con. It gives you ultimate control of nutrient intake. pH should be kept between 5.5 and 6.5, although I never stray outside of 5.8 to 6.2. <strong>Invest in a good pH meter.</strong>  <br> Important tip: use Calmag! Coco coir tends to absorb and prevent the distribution of calcium. The solution is to add CalMag when adding nutrients, per the instructions (it's about 1ml / liter of water). It's pretty much impossible to over-water coco coir. If you add too much water it simply drains out of the bottom. You should aim to water the plant until you first see run-off, then add about 20% more water / water-nutrient mix. It should be flushed regularly as salts (aka the some of the nutrients you put in) will accumulate on the coco fibers. Water when the pot gets light in weight. I've learned to pick up the pot and feel when it needs to be watered. You might not be able to over water coco coir, but you can certainly water it too often. This can result in fungus gnats (minor nuissance), or other issues. I generally wait until the pot has lost 3/4 of its weight before watering. A full grown plant needs to be watered every 2 days. A smaller plant in a big pot may only need water every 7 days. Depending on you schedule, you'll likely be watering as follows: (Water with Nutrients, pure water, pure water, repeat). If you have deficiencies you can alter this schedule: nutes-water-nutes-water, or nutes-nutes-water.\n<h3>Measuring PPM</h3> I also invested in an TDS gauge. <strong>This measures the level of dissolved salts: nutrients and naturally occurring minerals in the water.</strong> The measurement is in ppm (Parts per Million). This gauge can help prevent nutrient burn by ensuring that the water you put in doesn't have too much nutrients. It's easy to use, and there are several guides online on what your ppm should be during various stages of growth (seedling, vegetative, flowering). I use the gauge to measure the water going in and the runoff out the bottom of the pot. If the ppm is too high I simply dilute the water+nutrient solution, recheck the ppm and pH, adjusting if needed.\n<h3>pH Control and Nutrients</h3> <strong>I've been using Advanced Nutrients pH perfect and it's worked well.</strong> pH perfect is a bit of a misnomer: you still need to adjust the pH a bit for optimal results. Although I bought pH Down (Phosphoric Acid 85%) and pH Up, I've only ever used the pH Down. My tap water is at a steady 7.0 (lucky me). So, a few drops of pH Down are all that are needed to get the pH in the proper range. If I overshoot, I simply dilute my container with tap water so the pH goes back up and add a bit more nutrients. A few companies sell coco-specific nutrients. This goes without saying, but with nutes less is more. The only deficiency I've had was Calcium. Other than that, I've had nutrient burn more than once. <strong>I've adopted a new strategy of using as little nutes as possible</strong>, almost waiting for the plant to tell me it has a deficiency before adding nutrients. Unlike soil, you can change the nutrient conditions very quickly with coco coir. Since it's so porous and drains well, you can quickly add nutes or pure water to adjust any issues with the plant. With soil, you have to contend with whats in the soil already, which can often work against you. The downside is that you have to watch the plants like a hawk, since nutrient deficiencies or nutrient burn can happen very quickly.","o":"14","d":"This in-depth guide will help you optimize the Coco Coir medium for growing plants indoors.","i":[]},{"t":"Electrical Basics","s":"electrical-basics","c":"This article provides the basic electronics knowledge you'll need to build a Space Bucket. This is an extremely short introduction to electronics, so if you're interested in the topic you would do well to read something more comprehensive. The best book for beginning electonics is Practical Electronics for Inventors by Paul Scherz. It's cheap, covers a lot of material, and doesn't assume any prior knowledge.\n<h3>AC, DC and Power</h3> <strong>AC stands for alternating current and DC stands for direct current.</strong> An AC voltage is just a sinusoidally-varying voltage. You can still use Ohm's law with AC voltages and currents. The power delivered to the outlet in your home is an AC voltage, <strong>usually around 115VAC or 230VAC</strong> depending on where you are in the world . Often you'll want to convert the AC voltage from an outlet to a DC voltage, and that's what a typical DC power supply does. <strong>For example, the 12V wall wart power supply turns the AC voltage from the outlet to 12VDC</strong>.  <br> Electricity can be dangerous, especially to power coming from the wall. Make sure you understand and take responsibility for your actions when working with mains electricity. Power tells us about how much energy we're using in a given amount of time. <strong>It's important to figure out whether we have a good enough heatsink, a big enough power supply, or fat enough wires.</strong> Power equals voltage times current, or P = I x V. Power is measured in Watts, abbreviated with the letter W. So say you have a high power LED with a 30V forward voltage and a 1A forward current. That means the LED dissipates 30W, and you'd need a power supply greater than 30W to drive it. Some of that power gets turned into light, and some of that power gets turned into heat. While LEDs convert a greater proportion of power to light than, say, incandescent bulbs, they still generate plenty of heat that must be heatsinked.\n<h3>Voltage, Current and Ohm's Law</h3> <strong>Electricity is all about the flow of electrons to transfer energy</strong>. The best way to understand how this works is with the water analogy. Current is like flow; how much electricity is flowing through a circuit, or how much water is flowing through a pipe. Voltage is like pressure; the harder you push, the more flow you get. Resistance limits how much flow you get; a resistor resists the flow of electrons like a skinny pipe resists the flow of water. Ohm's law is the law for electricity. It's what relates current to voltage and resistance. Specifically, voltage equals current times resistance, or V = I x R. For a given resistance (measured in Ohms), the more current you'll get (measure in Amperes, or amps) for a given voltage (measured in volts). You might see these units expressed in units like millivolts or milliamps. These are just prefixes that act like multipliers on the units. For example, a milliamp is one one-thousandth of an amp. Volts are abbreviated with the letter V, amps with the letter A, and Ohms with the greek letter Omega.\n<h3>Electrical Circuits</h3> An electrical circuit is a closed conductive path for electrons to flow. <strong>If you connect a wire to both sides of a battery, you've made a circuit.</strong> Current flows from the positive side of the battery, through the wire, back into the battery's negative side. (This is called a short circuit. Don't do this). The most basic electrical circuit is a resistor attached to a voltage source, like a battery. The current through the resistor equals the voltage divided by the resistance, which we know because of Ohm's law. If there are multiple components in a circuit, we can figure out the current and voltage for each part using Kirchoff's laws.","o":"4","d":"Learn the fundamental and basic electrical knowledge you need to build a Space Bucket or any DIY indoor garden.","i":[]},{"t":"Heat Control","s":"heat-control","c":"A common problem with small enclosed gardens is high temperatures. Space Buckets can suffer from these problems, <strong>but there are many solutions available for high heat bucketeers.</strong> A proper lighting configuration and airflow design are essential for solving these issues.\nA thermometer is an indispensable tool when trying to solve heat issues. There devices are tiny, and can fit without problems inside the bucket. It is best to take more than one reading for more accurate results: <strong>the temperature will vary in the canopy and other areas of the growth chamber</strong>. Most thermometers also include a humidity sensor, which can be an important factor in the performance of the plant. It is also useful to measure the ambient temperature in which the bucket lives, as that will be the baseline to aim for. If the ambient temperature is already high, the bucket will naturally struggle with heat issues.\n<h3>Lighting Issues</h3> <strong>The main source of heat in any indoor garden comes from the lighting configuration.</strong> This is the disadvantage of using higher-wattage <a href='https://amzn.to/3jMfTYw'>CFL bulbs</a>: they have their ballast incorporated and inside the bucket. Going over 130w of CFL in a 5gal bucket is known to cause heat issues. Supersized builds can support a bit more, but as a general rule, between 4 and 6 <a href='https://amzn.to/3jMfTYw'>CFL bulbs</a> is the recommended limit. LED lights don't usually present heat issues, but that also depends on the particular installation. The most important thing to consider is to <strong>keep the heatsinks on the outside of the bucket.</strong> With UFO lights, this can be achieved just by placing the LED on top of the lid.\n<h3>Airflow Issues</h3> Most of the heating problems in a SB can be tracked back to an <strong>improper airflow configuration</strong>. The amount of ventilation needs to be proportional to the power of the main lighting, and specially so when using <a href='https://amzn.to/3jMfTYw'>CFL bulbs</a>. A minimum of 2 PC fans is recommended for 5gal builds, one exhaust and one intake. As heat rises, the exhaust works better on top of the bucket. An active intake blowing directly on the bulbs can lower their temperature drastically; for this reason, 3 PC fans are usually recommended when growing plants with bulbs.\nBuilds with UFO LEDs don't usually have heat issues, <strong>specially if the light is kept outside of the bucket</strong>. UFOs include a fan that keeps it mostly cool. That being said, UFO buckets still need proper airflow with at least 1 PC fan for intake. Humidity issues may appear if there is poor airflow.\n<h3>Nighttime Bucketing</h3> A good strategy when dealing with high ambient temperatures is to <strong>schedule the bucket to run on the night</strong>, which is naturally colder. Electrical rates are usually cheaper during this time, so this is a win-win bucket situation.","o":"7","d":"Learn how to control high temperatures in your DIY indoor garden. Proper lighting and airflow are essential for solving these issues.","i":[]},{"t":"LED Basics","s":"led-basics","c":"<strong>AC AND DC</strong> AC stands for 'alternating current' and DC stands for 'direct current'. An AC voltage is just a sinusoidally-varying voltage. You can still use Ohm's law with AC voltages and currects. The power delivered to the outlet in your home is an AC voltage, usually around 115VAC or 230VAC depending on where you are in the world . Often you'll want to convert the AC voltage from an outlet to a DC voltage, and that's what a typical DC power supply does. For example, the 12V 'wall wart' power supply turns the AC voltage from the outlet to 12VDC. Electricity can be dangerous, especially to power coming from the wall. Make sure you understand and take responsibility for your actions when working with mains electricity.\n<strong>POWER</strong><a href='https://en.wikipedia.org/wiki/Electric_power'>Power</a> tells us about how much energy we're using in a given amount of time. It's important to figure out whether we have a good enough heatsink, a big enough power supply, or fat enough wires. Power equals voltage times current, or P = I x V. Power is measured in Watts, abbreviated with the letter W. So say you have a high power LED with a 30V forward voltage and a 1A forward current. That means the LED dissipates 30W, and you'd need a power supply greater than 30W to drive it. Some of that power gets turned into light, and some of that power gets turned into heat. While LEDs convert a greater proportion of power to light than, say, incandescent bulbs, they still generate plenty of heat that must be <a href='https://en.wikipedia.org/wiki/Heat_sink'>heatsinked</a>. If you want to <strong>build your own LED grow light</strong> but don't have experience with electronics, the knowledge you need can be a little intimidating. Luckily, there is only a little bit of electronic theory you need to know to get going. We can't possibly cover everything, but here are some basic concepts to get you started.\n<h3>VOLTAGE, CURRENT, AND OHM'S LAW</h3> <a href='https://en.wikipedia.org/wiki/Electricity'>Electricity</a> is all about the flow of electrons to transfer energy. The best way to understand how this works is with the <a href='https://en.wikipedia.org/wiki/Hydraulic_analogy'>water analogy</a>. Current is like flow; how much electricity is flowing through a circuit, or how much water is flowing through a pipe. Voltage is like pressure; the harder you push, the more flow you get. Resistance limits how much flow you get; a resistor resists the flow of electrons like a skinny pipe resists the flow of water. <a href='https://en.wikipedia.org/wiki/Ohm%27s_law'>Ohm's law</a> is the law for electricity. It's what relates current to voltage and resistance. Specifically, voltage equals current times resistance, or V = I x R. For a given resistance (measured in Ohms), the more current you'll get (measure in Amperes, or amps) for a given voltage (measured in volts). You might see these units expressed in units like millivolts or milliamps. These are just <a href='https://en.wikipedia.org/wiki/Metric_prefix'>prefixes</a> that act like multipliers on the units. For example, a milliamp is one one-thousandth of an amp. Volts are abbreviated with the letter V, amps with the letter A, and Ohms with the greek letter Omega.\n<h3>ELECTRICAL CIRCUITS</h3> An electrical circuit is a closed conductive path for electrons to flow. If you connect a wire to both sides of a battery, you've made a circuit. Current flows from the positive side of the battery, through the wire, back into the battery's negative side. (This is called a <a href='https://en.wikipedia.org/wiki/Short_circuit'>short circuit</a>. Don't do this).\nThe most basic <a href='https://simple.wikipedia.org/wiki/Electrical_circuit'>electrical circuit</a> is a resistor attached to a voltage source, like a battery. The current through the resistor equals the voltage divided by the resistance, which we know because of Ohm's law. If there are multiple components in a circuit, we can figure out the current and voltage for each part using <a href='https://en.wikipedia.org/wiki/Kirchhoff%27s_circuit_laws#Kirchhoff.27s_voltage_law_.28KVL.29'>Kirchoff's laws</a>.\n<h3>DIODES AND LEDS</h3> <a href='https://en.wikipedia.org/wiki/Diode'>Diodes</a> are a type of <a href='https://en.wikipedia.org/wiki/Semiconductor'>semiconductor device</a> that only allow current to flow in one direction. In the water analogy, they are the equivalent of a <a href='https://en.wikipedia.org/wiki/Check_valve'>check valve</a>. Diodes have a 'forward voltage' that is the minimum voltage that must be applied across them to make them conduct from their positive terminal (Anode) to negative terminal (Cathode). When current flows through the diode, it always has this voltage across it. There are a lot more subtleties of diode behavior and special types of diodes that do specific things, but that's the basic idea. Current flows one way, and there's a voltage drop across it.\n<a href='https://en.wikipedia.org/wiki/Light-emitting_diode'>LEDs</a> are 'light emitting diodes' and, believe it or not, they are a special type of diode that emits light when conducting current. All of those annoying blinking lights on your TV, router, and other gadgets are LEDs. To drive one of these typical LEDs, we add the LED in series with the resistor in the basic electrical circuit descibed above. The current through the resistor and the LED will be the same, so the resistor limits the current through the LED. For a more complete tutorial on driving LEDs this way, check out <a href='https://www.baldengineer.com/led-basics.html'>this tutorial</a> and then come back here.\n<h3>HIGH-POWER LEDs</h3> For horticultural lighting, we're interested in high power LEDs. They draw a lot more current, which means they generate a lot more light and dissipate a lot more power, but they're still LEDs. You could drive them with a DC voltage source and a current-limiting resistor as described in the tutorial linked above, but this wouldn't be very efficient because the power dissipated in the resistor would be high. So instead, we will often drive high power LEDs with a constant-current power supply. Don't worry for now about how these work for now. Just know that you provide a DC or AC voltage to their input, and you get a constant DC current at their output. If you want to drive a high power LED with one, you simply connect the positive side of the LED (Anode) to the positive side of the supply output, and negative to negative. You get the current specified from the power supply, as long as the power supply is capabale of providing that current at the LED's forward voltage. (Remember that power is current times voltage, so high power LEDs often require both high voltage and high current.) More on this later.\n<h3>CONCLUSION</h3> 'I wanna make a big honkin' LED light,' you say, 'what's all this have to do with anything?' When you're learning anything technical, it can be overwhelming to read about the theory and difficult to see how it matters. Don't worry, you don't have to remember or even understand it all now. <strong>This information provides the basic electronics knowledge you'll need to build an LED grow light, and will serve as a reference for all future discussions.</strong> Refer back to this post as needed while we get into more details of designing your grow light.\n<h3>RECOMMENDED READING</h3> This is an extremely short introduction to electronics, so if you're interested in the topic you would do well to read something more comprehensive. The best book for beginning electonics is Practical Electronics for Inventors by Paul Scherz. It's cheap, covers a lot of material, and doesn't assume any prior knowledege.","o":"9","d":"Learn the basics of LED lighting and its many uses in DIY indoor gardening setups.","i":[]},{"t":"LED Bulbs","s":"led-bulbs","c":"<strong>LED bulbs can be used for Space Buckets, and they are a good replacement for standard <a href='https://amzn.to/3jMfTYw'>CFL</a> builds.</strong> The main advantage of <a href='https://amzn.to/3lyKIRa'>LED bulbs</a> is that you can keep the heatsink on the outside, avoiding many heat problems. They also have better electrical efficiency and are commonly cheaper than equivalent <a href='https://amzn.to/3jMfTYw'>CFL bulbs</a>. For better results, you can to remove the protective cap on top of the bulb to take advantage of LEDs unidirectional light output, as the cap will diffuse the light in different directions. Make sure the LEDs are all pointing the same way. This will optimize the lighting configuration.\n<h3>Types of LED bulbs and Safety </h3> Important note on safety: When removing the cover or diffuser on an LED lamp, <strong>you may be exposing yourself to very unsafe DC voltage.</strong> Count the LED's. If there are more than 20 LED's then you should probably think about using a different brand of LED. This is because the SMD LED's commonly used in LED e27 lightbulbs use about 3v. Wired in series, the string could require upwards of 60vDC. Although this voltage may be safe, you are quickly approaching the range of voltage that can pass current through the human body. This is regardless of AC or DC.","o":"10","d":"LED bulbs can be used to grow all kinds of plants indoors. Space Buckets are a great fit for these lighting option.","i":[]},{"t":"Light Top","s":"light-top","c":"The Light-Top is the heart of a Space Bucket. <strong>It contains the main lighting configuration, and as such determines the performance of the indoor garden.</strong> If the light-top is underpowered, plants will grow long and thin which makes it unstable; if it is overpowered, heat and photosynthesis issues will be common (there is such thing as too much light for a plant). A light-top can be made with either <a href='https://amzn.to/3jMfTYw'>CFL</a> or LED lighting.\n<h3>CFL lighting</h3> Compact Fluorescent Lights are the cheapest option, but also the hardest to optimize. <strong><a href='https://amzn.to/3jMfTYw'>CFL bulbs</a> emit a lot of heat that needs to be extracted from the plant chamber</strong>, and because of that, extra airflow is needed. The best CFL bulbs for Space Buckets are the 23 and 42 watt versions, which feature a good balance between heat and lumen output. Bulbs over 42w can be a safety hazard in an enclosed container, while bulbs under 23w are not an effective option.\nLED lighting is the present and future of Space Buckets. This technology has a smaller heat footprint, something essential for indoor bucket gardening. These lights also have a higher lumen per watt output. There are two main LED options for bucket gardening: traditional bulbs (with E27 sockets), to UFO style fixtures.\n<h3>LED Bulbs</h3> <a href='https://amzn.to/3lyKIRa'>LED bulbs</a> have become an interesting option for budget-minded bucketeers. <strong>The best bulbs for these kind of buckets are 8.5 to 10w.</strong> A LED-bulbed SB can be made following a SAG style build blueprint. In this case, 4 or 5 bulbs are installed vertically on the bucket lid. The plastic covers can be removed to optimize the bulbs lumen output, but for some newer models that is not recommended. <strong>For safety reasons, if the bulb has over 20 LEDs inside, it is better to keep the cover in place.</strong>\nOne solution to the problems caused by the uncovered <a href='https://amzn.to/3lyKIRa'>LED bulbs</a> is to install a <strong>heat shield</strong>, which is fitted between the lights and the plant chamber. This is an essential upgrade for buckets that have high temperatures, and a great way to cover the exposed parts of the light fixture. The preferred material for heat shields is glass, which can be custom cut and stays cold to the touch. Acrylic or plexiglass can also be used, but is has to be monitored more closely (acrylic can melt or warp under high heat conditions).\n<h3>UFO LED</h3> <strong>The best option for LED Space Buckets are definitely UFO lights</strong>, which come in a round shape that fits a 5gal bucket perfectly. With this option, it is just a matter of putting the light on top of the lid and plugging it into the wall. <a href='https://amzn.to/36NO5zr'>UFO LED light</a> are the true <strong>plug and play solution for Space Buckets</strong>.\nThese lights can be found in a variety of wattages. For the classic Space Bucket with 5gal containers, a 135w UFO is enough. For supersized builds that feature 10gal containers, 180w are a better option. For Space Buckets that use stacked tote, a 300w UFO will be essential. As a general rule of thumb, the bigger the container, the more wattage will be needed for optimal results.\nSome bucketeers install the UFO inside the container, which is not recommended and requires the reversal of the light fans. Though this is a viable option, <strong>it is better to install the UFO light outside of the container</strong>, which keeps the heat away from the growing chamber.\n<h3>Light-top Airflow</h3> Proper heat extraction is essential for Space Buckets, and more for the light-top part of the setup. <strong>Just one PC fan blasting directly onto the bulbs can be enough to keep the heat under control.</strong> An extra fan exhaust on top of the lid is recommended in most situations, as it creates better airflow circulation between the lights. CFL bulbs have a higher temperature footprint, and because of that they usually require extra fans. Keep in mind that the temperature inside the bucket will never be inferior to the temperature of the ambient it is in.","o":"2","d":"The Light-Top is the heart of a Space Bucket. It contains the main lighting configuration, and determines the performance of the indoor garden.","i":[]},{"t":"Main Container","s":"main-container","c":"Space Buckets can be created with a <strong>wide variety of containers.</strong> The original design features 5gal buckets which are cheap (or free) and easy to find, but many other plastic containers have been tested successfully. Supersized bins and Brute buckets are a great alternative for bucketeers that want more space for their plants. Boxes and totes are another great option that allows for high wattage lighting.\n<h3>Buckets</h3>      The best kind of buckets to build Space Buckets are of the <a href='https://amzn.to/33ufG6O'>5gal variety</a>. <strong>This size has a very small footprint and allows for one plant cultivation.</strong> When in doubt, go with 5gal containers: the community has a lot of experience using them, and they are many examples and tips for this design. The best feature of 5gal buckets is that they are easily stackable, which makes them naturally modular. A 5gal bucket with a <a href='https://amzn.to/3cTWBxT'>135w UFO</a> and <a href='https://amzn.to/2SqBauJ'>5630SMD</a> LEDs will provide solid performance for all kinds of plants.\n<h3>Brutes</h3> <strong>Supersized containers have evolved alongside the classic Space Bucket design.</strong> This option is perfect for gardeners that wish to grow bigger plants, or for those who feel constrained by the dimensions of the 5gal bucket. <a href='https://amzn.to/3cXD27R'>Brute buckets are sold by Rubbermaid</a>, and work very well for SB gardening: these containers are sturdy, stackable and easy to expand. There are 10gal, 20gal and 32gal options, which can all be used for Space Bucketing. The 10gal brutes are a safe step up from the original containers. The only real disadvantage of Brutes is their price and general availability. The <a href='/u/bruteLED'>Simple LED Brute by /u/halfmpty</a> is a great example for this kind of style.\n<h3>Bins</h3> A cheaper alternative to Brute containers are </trong>plastic garbage bins</strong>, which are easier to find and also come in a <a href='https://amzn.to/2GyHEoK'>wide variety of sizes</a>. These containers work well for SB gardens, but they are <strong>usually not stackable</strong>, which makes them harder to tweak. This is a good option for bucketeers that want a big garden with materials that they already have around the house.\nBrutes or Bins, given their supersized nature, <strong>need extra lighting power to function properly</strong>. A <a href='https://amzn.to/36NO5zr'>UFO LED light</a> is the minimum viable solution for supersized main lighting. LED strips are also essential for these kind of builds: multiple strips can be installed in the container to reach the lower parts of the plants.\n<h3>Totes</h3> A Space Bucket can also be made with <strong>plastic boxes, generally known as totes</strong>. These rectangular containers are even bigger than supersized Brutes, and usually come in <a href='https://amzn.to/33sAcEQ'>various versions</a>. They have a bigger footprint than buckets, buy <strong>they allow for more powerful designs.</strong> Tote gardens stack two containers on top of each other, with one inverted functioning as the light-top. This means that the SB tote design features a fixed height. Given their massive size, SB totes need powerful lighting from all sides, with a <a href='https://amzn.to/3isnVo5'>300w UFO LED panel</a> being the most recommended option.","o":"1","d":"Space Buckets can be created with a wide variety of containers. The original design features 5gal buckets which are cheap, but many other options work well.","i":[]},{"t":"Pest Control","s":"pest-control","c":"Pests are one of the biggest challenges that a gardener has to face, and this is also true in small enclosed containers like Space Buckets. <strong>A pest invasion can ruin a garden at any point, so it is important to know how to keep them at bay.</strong> The techniques used for pest control in bigger gardens can be used for Space Buckets too.\nAs a general rule, it is always better to use organic pesticides that are safe for human consumption, especially when growing plants like cannabis, hot peppers or cherry tomatoes. Do not use chemical pesticides if you plan to eat the fruits of your labor.\n<h3>Neem Oil</h3> </trong>Neem Oil is a safe and always recommended alternative pesticide.</strong> This is a vegetable oil that is pressed from the fruits and seeds of the neem plant. This oil, when sprayed on a plant, <strong>acts as a natural pesticide that repels a wide variety of insects, including spidermites and aphids, two of the most common pests. It also repels caterpillars, locusts, fungus gnats, ants, thrips, leafminers and more</strong>. Other than insects, Neem controls powdery mildew, black spot and rust fungi, all while being completely safe to mammals, birds and beneficial insects (like ladybugs). To apply Neem Oil it is best to spray the plant as with any other pesticide. Use the Neem oil to cover the entire plant, especially on the underside of the leaves, where lots of bugs hide. Repeat the process every 3-4 days fro two weeks and the plant should be pest free. You can also spray the soil, as the plant will absorb and distribute it along its tissue. <strong>Once the neem compound is present in the plant vascular system, the pests intake it during their feeding</strong>, and that is the end of them.\n<h3>Diatomaceous Earth</h3> Diatomaceous Earth is another great and natural tool to fight off pests, and it works great in combination with Neem Oil. <strong>DE is a soft, sedimentary rock that can be turned into a fine powder. It consists of fossilized remains of diatoms</strong>, a type of hard-shelled organisms. Among other things, it is used as a mechanical pesticide, and can be specially useful for controlling pests in small spaces. The fine powder of Diatomaceous Earth absorbs lipids from the insect's exoskeletons, causing them to dehydrate and die. This also works for other pests, like gastropods and slugs. Also pH is DE neutral, and because it is a mineral source of pH, <strong>it tends to stabilize pH in soil and hydroponics</strong>.\n<h3>Top Soil Layer</h3> One of the easiest and most effective pest control techniques is to <strong>put a layer of material on top of the soil of the plang: Diatomaceous Earth, perlite or aquarium gravel all work well for this application.</strong> Once the top part of the soil is covered, the pests ability to reproduce will be greatly reduced, interrupting their remaining life-cycle. Perlite is usually the best choice for this application, as Diatomaceous Earth can get muddy after a few waterings.","o":"11","d":"Pests are one of the biggest challenges that a gardener has to face, and this is also true in DIY setups like Space Buckets.","i":[]},{"t":"Plant Species","s":"plant-species","c":"Space Buckets can be used to grow nearly all species of plants, <strong>specially those that are naturally short or react well to training.</strong> For this reason, plants like cannabis, hot peppers, cherry tomatoes, and leafy herbs are all very recommended. Even if the plant is a tree, a SB can function as a highly effective growth chamber: tree saplings can be started indoors to strenghten them before planting in an outside location. <strong>Bucket gardens also have great performance for all kinds of cuttings and clones, and can be used to sustain plants during the winter time.</strong>\n<h3>Cannabis</h3> This species is the most popular among bucket gardeners for a variety of reasons. <strong>Cannabis plants require optimum lighting and enviromental conditions</strong>, which can be easily controlled inside a small enclosed container. Bucket cannabis plants are typically vegged for about a month while training agressively, and then flowered according to the strain. The most difficult part of growing this plant inside a bucket is controlling the flowering stretch, which can multiply the height three fold. Techniques like topping and LST are absolutely essential for cannabis in SB.\n<h3>Cherry Tomatoes </h3> This is one of the most rewarding plants that can be grown in a Space Bucket. <strong>Cherry tomatoes are relatively easy to grow, and can produce many fruits in a short period of time</strong>. There are many varieties available and all work well with SB, given their naturally short stature. Cherry tomatoes can be pruned, topped and trained, which will be essential for a good bucket performance. As with hot peppers, it is recommended to pollinate cherry tomatoes manually, gently shaking the branches or using an electrical toothbrush to distribute the pollen.\n<h3>Hot Peppers</h3> SB can be used to grow every species of hot peppers, and a lot of bucketeers choose this plant. <strong>Variants like habanero and jalapeño are especially popular among bucket gardeners</strong>. These plants don't need a very aggressive training, though they benefit from LST and HST techniques. Some topping is usually required, and manual pollination is recommended to increase the pepper yields. The lighting schedule depends on the specific strain, but 12/12 is a safe bet. Reddit communities like /r/HotPeppers are a good resource for these kinds of plants.\n<h3>Herbs and Greens</h3> Space Buckets can also be used to grow all kinds of herbs: these plants have great performance and are much easier to maintain, as they general don't require any training. Harvest is much more regular, because the important parts are the leaves and not the fruits or flowers, which are harder to produce. <strong>Some examples of great bucket herbs are basil, chives, dill, rosemary, oregano, mint and more.</strong>\n<h3>Other Plants</h3> Over the years, bucketeers have experimented with many plant species, like strawberry, potatoes, wasabi and even an avocado sapling. Expanding the bucket plant portfolio is a good cause!","o":"12","d":"DIY indoor gardens can be used to grow all species of plants, specially those that are naturally short or react well to training.","i":[]},{"t":"Plant Training","s":"plant-training","c":"Space Buckets can be used to grow many kinds of plants, but they need to be trained to fit the limits of its container. Even with supersized gardens, plant training is a must, an essential tool for bucketing. Untrained plants can outgrow their buckets easily, which means a poor performance.\nPlant training techniques can be divided into two main e: <strong>Low Stress Training, which includes bending, tucking and guiding the stems; and High Stress Training, which purposely stresses the plant to make it heal stronger.</strong> Because of its low stress implications, LST can be started early in the life of a plant, and it is specially useful for cannabis and hot peppers. As the plant gets older, it stem hardens, which makes the training more difficult. HST techniques can be more effective, but also pose a higher risk of failure. These methods have a drastic impact on the plant, and require a few days of healing time. They are also very recommended for bucket gardening, and sometimes inevitable.\n<h3>LST</h3> The most basic form of training implies <strong>bending the stems of the plant to make it grow in a horizontal fashion.</strong> This can be achieved with hooks that wrap around the stems and into the soil. With this method, the plant grows into a bush form, creating a more even canopy, something that is very important for gardening in small spaces. It can be hard to predict the growth pattern of a plant, so every new hook needs to be strategically planted along the way.\n<h3>Tucking</h3> Tucking leaves is another useful LST technique, and a good alternative to pruning. In this case, <strong>the idea is to pull leaves that are blocking important parts of the plant, like flowering tops.</strong> Instead of removing the leaf, it can be tucked behind a stem, exposing a part that needs to be emphasized. This is usually better than pruning, as it does not require healing time and allows the plant to use the nutrients stored in the leaf. In situations where tucking is impossible, a bit of prunning can be useful, but only removing a few leaves at a time.\n<h3>Topping</h3> Topping is the main HST technique in a bucketeers arsenal. <strong>This method requires removing the topmost growth of the plant, which forces it to grow in a bushier kind of tree</strong>. When applied early, topping alters the canopy significantly, and limits the height of the plant. This training technique can be used multiple times, and every time it will multiply the number of branches. Because it removes unwanted parts of the plant, topping results in a cleaner, more predictable training. Even though topping is a powerful tool for plant training, it is a High Stress technique: topped plants need a few days of healing to recover. During that time, further training is not recommended. Keep in mind that not all plants react positively to topping, so research species characteristics before using this or other HST techniques.\n<h3>Supercropping</h3> Supercropping is another useful tool for controlling the plants growth and training its canopy: in its simplest form, <strong>it means pinching the stem to force the plant to heal its internal structure. Once healed, this results in stronger and faster growth.</strong> The most important part of supercropping is to avoild breaking open the stem, and just crushing it. A whole branch of the plant can die if the Supercropping is excessive. Supercropping tends to be considered a controversial technique, given its high stress methods. As with topping, not all plants react positively to this kind of training. Supercropping is recommended for gardeners that already have some experience in plant growing.","o":"13","d":"DIY indoor gardens can be used to grow many kinds of plants, but they need to be trained with LST, topping, tucking or supercropping.","i":[]},{"t":"Safety Guidelines","s":"safety-guidelines","c":"As a (former) electrician for 10 years who went through a 5 year union apprenticeship program and a hardcore electronics geek, <strong>I want to give a few safety tips because I've seen some stuff that's got my spider-sense tingling.</strong> Everything is done at your own risk and liability. I just want to minimize that risk.\n<h3>Use a GFCI!</h3> That's Ground Fault Circuit Interrupter. You have electricity and a lot of moisture: that could be a bad combination. <strong>GFCI protects you from ground path faults.</strong> In other words, it prevents serious shocks from the wall power supply, through your body and to ground. Literally, this means a ground path to earth itself or a ground path to an object at ground potential. Twice I've had GFCI protect me from being severely shocked. You'll still feel a slight tingle but that's it. No dying, though. How cool is that! GFCI does not protect you from hot and neutral wire shocks because it only <strong>shuts the circuit off if there's a current imbalance between the hot and neutral wire.</strong> If there is, it means current is going to ground when it's not supposed to. That's bad- it could be going through your flailing and thrashing body. A GFCI circuit does not require a ground wire to work. GFCI can be found in breakers, receptacles, power strips or adapters. How much is your life worth?\n<h3>All lighting sockets need to be wired the right way</h3> <strong>I don't care if it is just two wires. One is the hot (black) and one is the neutral (white).</strong> If you have a brown and blue wire, it's almost always the case that the brown is the hot and the blue is the neutral. You'll see this in some appliances and extension cords depending where you live in the world. If the socket has pig tails (it's own wire sticking out), it's always hot wire to socket black wire and the neutral wire to the socket white wire. NO EXCEPTIONS! If there's screws instead of wires, the brass/gold colored one is for the hot wire and the silver colored one for the neutral wire (more below on this). Why is this so important? Because when you screw in a bulb there might be a little metal exposed at the bulb's base. Wired backwards and you have an energized metal part exposed (bad). Wired correctly and you have a exposed metal part at ground potential (better). <strong>Wrap any exposed with a little tape and you have very good.</strong> If you have a lighting socket with 2 of the same colors coming out, the neutral will be connected to the socket side threads, the hot connected to the metal piece deep in the center of the socket. In this case you need a continuity tester or multimeter to determine which wire is the neutral.\n<h3>Splice wires correctly</h3> With Space Buckets you're going to run in to situations where a junction box may not be able to be used so here's some open air splicing tips. <strong>If you can pull the wires apart then you have a bad splice. The preferred way is using wire nuts.</strong> Strip your wires 5/8ths of an inch, put them in the opening and twist until you can't anymore. There's a spring inside that tightens the wires together. It's not necessary to twist the wires first. You should, however, tug on each wire to make sure it's well connected after the wire nut is twisted on. Tape the wire nuts up. You should so no exposed metal parts from any angle. The second way is a butt splice (hehehe...he said butt. I will always be a Beavis and Butthead fan). They’re sometimes called <strong>splice crimps</strong>. Strip wires, stick them in and use pliers to crimp the aluminum tube inside as hard as possible. There are special pliers for this but any pliers can do. Again, tug on the wires to make sure they're secure and tape as needed. The third way is tape and solder. Twist the wires in a rat-tail splice, solder them up and use a higher quality electrical tape preferable <strong>Scotch Super 33+</strong> to wrap them up. 33+ has an adhesive that hold under a wide range of temperature and humidity. Look at the reviews. I only use low quality electrical tape for temporary stuff. Everything else it's 33+. Low quality electrical tape has a bad habit of becoming undone at higher temperatures and humidity. Twist and tape alone is strongly not recommend for line voltage splicing. The same with a Western Union splice or a T-splice unless tape and solder is also used. Be generous with the tape and tape it tight.\n<h3>If using foil as a reflector, it's a good idea to ground it</h3> With three conducts you'll typically have a black, white and green (or brown, blue, green or green with a yellow stripe depending where you live). <strong>That green wire is your grounding wire.</strong> Metal parts should be bonded to this green wire (intracanopy LEDs on their own, isolated low voltage power supply don't need to be grounded). You can use like a screw/nut/washer through the bucket side, through the foil and put the green wire under the washer preferably with a fork terminal stake on. If you're connecting wires to a light socket with the gold/silver screws mention above, this is the preferable way to connect the wires. Put tape over the screws with some 5 minute epoxy to make sure the tape stays in place. The best inside the bucket reflector is flat white paint with barium sulfate added. It'll be in the high 90% range.\n<h3>Secure those wires</h3> This means <strong>additional stain relief and to preferably use tie wraps</strong> to secure the wire to the bucket's lid. Drill 2 small holes just big enough for the tie wrap and secure the wire to the lid that way. Sticky backs can also be used. Use some 5 minute epoxy if needed to secure the sticky back.\n<h3>Wet concrete floors are bad</h3> Get them off the floor and get yourself off the floor. It's just another safety thing to keep in mind. Wet concrete has a bad habit of conducting electricity. <strong>Play it safe and think of wet concrete as standing in a mud puddle from an electrical safety stand point.</strong> This is why it's a good idea to have GFCI protection in garages.\n<h3>Push those prongs together</h3> Even it everything feels snug, it may actually be 1 or 2 out of 3 that are snug. Loose connections means fire. Fire is bad (in this case, otherwise fire is your friend, but I digress...). <strong>Push the male prongs together to the point that you have to do a little wiggling to plug something in.</strong> This is really more critical wire higher current loads like electric space heaters, HPS lighting and the like but a good habit to get in to.\n<h3>No line voltage at canopy</h3> If you use LED intracanopy lighting, <strong>use a lower voltage to drive them.</strong> I'll be showing multiple ways on how to do this in my lighting guide for people of different skill levels. I'll also be showing a safe exception to this rule.","o":"5","d":"Follow these safety guidelines to make your that your DIY indoor garden is following the best electrical practices.","i":[]},{"t":"Side Lighting","s":"side-lighting","c":"A very important kind of lighting for bucket gardening are LED strips, which <strong>can be installed on the walls of the container as a supplemental source of lumens.</strong>\nThese SMD LEDs (Surface-Mount Device) are not powerful enough to act as the main lighting, but <strong>they provide sufficient energy to make a difference for the plant.</strong> This is specially useful for crowded buckets, as the sidelighting penetrates below the top canopy. LED strips are a cheap and always recommended upgrade for any bucketeer.\n<h3>LED strip types</h3> There are many types of SMD LEDs: <strong>for Space Buckets, 5050, 5630 and 7020 chips are recommended</strong>, while 3528 should be avoided. The <a href='https://amzn.to/30TZOZn'>5630SMD LED</a> offer the best heat to lumen ratio, and are much brighter than the <a href='https://amzn.to/30OqRW0'>5050SMD strips</a>. Meanwhile, 7020 chips are harder to find and less reliable, with a higher heat footprint. All of the LED strips can be purchased in waterproof and non-waterproof variants. For SB, the waterproof strips are the most durable and recommended.\n<h3>Single chips</h3> Single LED chips can also be used for Space Bucket sidelighting: <strong>an array of 1w or 3w LEDs can provide an interesting alternative to SMD strips</strong>. This solution is usually harder to install, but more effective in the long run. With these kind of LEDs, it is always a good idea to keep the heatsinks on the outside of the growing container.","o":"6","d":"A very important kind of lighting for DIY gardening are LED strips, which are installed on the walls as a supplemental source of lumens.","i":[]},{"t":"Smell Control","s":"smell-control","c":"Controlling odors from smelly plants is a very popular topic among indoor gardeners, and Space Buckets are not the exception. Even though there are many options for reducing/removing the odors some plants exhibit, <strong>it is difficult to assure 100% 'odor proofness.' For this reason, the bucket community never recommends growing in high risk situations.</strong>\nIt's advised against growing offensive plants, especially when others inside the home may have an issue with it, and one should also be at least acquainted with the laws and penalties of the jurisdiction in which they reside.\n<h3>Inline filtering</h3> The most effective solution for controlling plant odors in Space Bucket gardens are <strong>inline fans with a specially designed filter</strong>. These are the same filters that tent growers use, and because of that they tend to be bulky, expensive, quite loud and is another piece of equipment using electricity. The upside is that inline fans are exceptionally powerful, and thus can filter the air extracted from one or many interconnected buckets. A 4 inch inline fan with a capacity of 300m3/h should be more than enough. The SB gallery features many builds that use this kind of filtering.\nThese inline fans are a centrifugal type fan, and are very effective by design at creating pressure, which is what is needed to push air through a carbon filter. For this reason cheaper DIY solutions using PC fans are pretty difficult to make effective.\n<h3>Homemade filters</h3> Bucketeers can choose to build their own filters, which is usually <strong>not very effective for strong odors</strong>. There are many versions of DIY filters floating around the Internet, but none has proven to be really useful. The general idea is to stack two pencil cup holders with activated carbon in between. The problem is that PC fans are not powerful enough to make a difference, and even line-voltage fans will struggle to move the air through the carbon. A very powerful fan may be sufficient, but at that point an inline fan would be a smarter choice.\n<h3>ONA gel</h3> One supplemental option for activated carbon filters is <strong>ONA gel, a material that masks the smell in the room that is present.</strong> This won't remove the odor from the ambient, but it will change its appearance. For this reason, a combination of ONA gel and inline fan + filter is the safest bet for smell concerned bucketeers. The apple crumble version of ONA gel is usually the most effective and recommended.","o":"8","d":"Controlling odors from smelly plants is a very popular topic among indoor gardeners, and Space Buckets are not the exception. ","i":[]}]